{"IfcActuatorType / IfcActuator": {"description": "An actuator is a mechanical device for moving or controlling a mechanism or system. An actuator takes energy, usually created by air, electricity, or liquid, and converts that into some kind of motion.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcActuator.htm", "predefined_types": {"ELECTRICACTUATOR": "A device that electrically actuates a control element.", "HANDOPERATEDACTUATOR": "A device that manually actuates a control element.", "HYDRAULICACTUATOR": "A device that hydraulically actuates a control element.", "NOTDEFINED": "Undefined type.", "PNEUMATICACTUATOR": "A device that pneumatically actuates a control element.", "THERMOSTATICACTUATOR": "A device that thermostatically actuates a control element.", "USERDEFINED": "User-defined type."}}, "IfcAirTerminalBoxType / IfcAirTerminalBox": {"description": "An air terminal box typically participates in an HVAC duct distribution system and is used to control or modulate the amount of air delivered to its downstream ductwork. An air terminal box type is often referred to as an \"air flow regulator\".", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcAirTerminalBox.htm", "predefined_types": {"CONSTANTFLOW": "Terminal box does not include a means to reset the volume automatically to an outside signal such as thermostat.", "NOTDEFINED": "Undefined terminal box.", "USERDEFINED": "User-defined terminal box.", "VARIABLEFLOWPRESSUREDEPENDANT": "Terminal box includes a means to reset the volume automatically to a different control point in response to an outside signal such as thermostat: air-flow rate depends on supply pressure.", "VARIABLEFLOWPRESSUREINDEPENDANT": "Terminal box includes a means to reset the volume automatically to a different control point in response to an outside signal such as thermostat: air-flow rate is independent of supply pressure."}}, "IfcAirTerminalType / IfcAirTerminal": {"description": "An air terminal is a terminating or origination point for the transfer of air between distribution system(s) and one or more spaces. It can also be used for the transfer of air between adjacent spaces.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcAirTerminal.htm", "predefined_types": {"DIFFUSER": "An outlet discharging supply air in various directions and planes.", "GRILLE": "A covering for any area through which air passes.", "LOUVRE": "A rectilinear louvre.", "NOTDEFINED": "Undefined air terminal type.", "REGISTER": "A grille typically equipped with a damper or control valve.", "USERDEFINED": "User-defined air terminal type."}}, "IfcAirToAirHeatRecoveryType / IfcAirToAirHeatRecovery": {"description": "An air-to-air heat recovery device employs a counter-flow heat exchanger between inbound and outbound air flow. It is typically used to transfer heat from warmer air in one chamber to cooler air in the second chamber (i.e., typically used to recover heat from the conditioned air being exhausted and the outside air being supplied to a building), resulting in energy savings from reduced heating (or cooling) requirements.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcAirToAirHeatRecovery.htm", "predefined_types": {"FIXEDPLATECOUNTERFLOWEXCHANGER": "Heat exchanger with moving parts and alternate layers of plates, separated and sealed from the exhaust and supply air stream passages with primary air entering at secondary air outlet location and exiting at secondary air inlet location.", "FIXEDPLATECROSSFLOWEXCHANGER": "Heat exchanger with moving parts and alternate layers of plates, separated and sealed from the exhaust and supply air stream passages with secondary air flow in the direction perpendicular to primary air flow.", "FIXEDPLATEPARALLELFLOWEXCHANGER": "Heat exchanger with moving parts and alternate layers of plates, separated and sealed from the exhaust and supply air stream passages with primary air entering at secondary air inlet location and exiting at secondary air outlet location.", "HEATPIPE": "A passive energy recovery device with a heat pipe divided into evaporator and condenser sections.", "NOTDEFINED": "Undefined air to air heat recovery type.", "ROTARYWHEEL": "A heat wheel with a revolving cylinder filled with an air-permeable medium having a large internal surface area.", "RUNAROUNDCOILLOOP": "A typical coil energy recovery loop places extended surface, finned tube water coils in the supply and exhaust airstreams of a building.", "THERMOSIPHONCOILTYPEHEATEXCHANGERS": "Sealed systems that consist of an evaporator, a condenser, interconnecting piping, and an intermediate working fluid that is present in both liquid and vapor phases where the evaporator and condensor coils are installed independently in the ducts and are interconnected by the working fluid piping.", "THERMOSIPHONSEALEDTUBEHEATEXCHANGERS": "Sealed systems that consist of an evaporator, a condenser, interconnecting piping, and an intermediate working fluid that is present in both liquid and vapor phases where the evaporator and the condenser are usually at opposite ends of a bundle of straight, individual thermosiphon tubes and the exhaust and supply ducts are adjacent to each other.", "TWINTOWERENTHALPYRECOVERYLOOPS": "An air-to-liquid, liquid-to-air enthalpy recovery system with a sorbent liquid circulates continuously between supply and exhaust airstreams, alternately contacting both airstreams directly in contactor towers.", "USERDEFINED": "User-defined air to air heat recovery type."}}, "IfcAlarmType / IfcAlarm": {"description": "An alarm is a device that signals the existence of a condition or situation that is outside the boundaries of normal expectation or that activates such a device.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcAlarm.htm", "predefined_types": {"BELL": "An audible alarm.", "BREAKGLASSBUTTON": "An alarm activation mechanism in which a protective glass has to be broken to enable a button to be pressed.", "LIGHT": "A visual alarm.", "MANUALPULLBOX": "An alarm activation mechanism in which activation is achieved by a pulling action.", "NOTDEFINED": "Undefined type.", "RAILWAYCROCODILE": "An electrical contact placed between the rails (in the four-foot way) to provide warnings in the locomotive cab.", "RAILWAYDETONATOR": "A coin-sized device that is used as a loud warning signal to train drivers. It is usually placed on the top of the rail, usually secured with two lead straps, one on each side.", "SIREN": "An audible alarm.", "USERDEFINED": "User-defined type.", "WHISTLE": "An audible alarm."}}, "IfcAudioVisualApplianceType / IfcAudioVisualAppliance": {"description": "An audio-visual appliance is a device that displays, captures, transmits, or receives audio or video.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcAudioVisualAppliance.htm", "predefined_types": {"AMPLIFIER": "A device that receives an audio signal and amplifies it to play through speakers.", "CAMERA": "A device that records images, either as a still photograph or as moving images known as videos or movies.  Note that a camera may operate with light from the visible spectrum or from other parts of the electromagnetic spectrum such as infrared or ultraviolet.", "COMMUNICATIONTERMINAL": "A communication terminal is an audio communication device that is usually installed along transportation infrastructure (railways, roads, tunnels etc.) in order to be used by the general public or operation agents for communication. It may specifically be used to make calls to emergency services in tunnels.", "DISPLAY": "An electronic device that represents information in visual form such as a flat-panel display or television.", "MICROPHONE": "An acoustic-to-electric transducer or sensor that converts sound into an electrical signal.  Microphones types in use include electromagnetic induction (dynamic microphones), capacitance change (condenser microphones) or piezoelectric generation to produce the signal from mechanical vibration.", "NOTDEFINED": "Undefined type.", "PLAYER": "A device that plays audio and/or video content directly or to another device, having fixed or removable storage media.", "PROJECTOR": "An apparatus for projecting a picture on a screen. Whether the device is an overhead, slide projector, or a film projector, it is usually referred to as simply a projector.", "RECEIVER": "A device that receives audio and/or video signals, switches sources, and amplifies signals to play through speakers.", "RECORDINGEQUIPMENT": "A recording equipment is a device that records telephone calls or other types of audio data. It also provides the function of archiving and immediate replay.", "SPEAKER": "A loudspeaker, speaker, or speaker system is an electroacoustical transducer that converts an electrical signal to sound.", "SWITCHER": "A device that receives audio and/or video signals, switches sources, and transmits signals to downstream devices.", "TELEPHONE": "A telecommunications device that is used to transmit and receive sound, and optionally video.", "TUNER": "An electronic receiver that detects, demodulates, and amplifies transmitted signals.", "USERDEFINED": "User-defined type."}}, "IfcBeamType / IfcBeam": {"description": "An IfcBeam is typically a horizontal, or nearly horizontal, structural member that is capable of withstanding load primarily by resisting bending. It may also represent such a member from an architectural point of view. It is not required to be load bearing.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBeam.htm", "predefined_types": {"BEAM": "A standard beam usually used horizontally.", "CORNICE": "A non-loadbearing beam on the longitudinal edge of bridge slab, usually encasing installations.", "DIAPHRAGM": "End portion of a girder transmitting loads to supports and providing moment resistance to adjoining segment.", "EDGEBEAM": "A beam on the longitudinal edge of bridge slab, usually concrete, providing additional stiffening and protection from the elements.", "GIRDER_SEGMENT": "A segment of a girder (e.g. each span of a continuous girder).", "HATSTONE": "A beam on top of a retaining wall or a wing wall, preventing earth movement.", "HOLLOWCORE": "A wide often prestressed beam with a hollow-core profile that usually serves as a slab component.", "JOIST": "A beam used to support a floor or ceiling.", "LINTEL": "A beam or horizontal piece of material over an opening (e.g. door, window).", "NOTDEFINED": "Undefined linear beam element.", "PIERCAP": "A transversal beam on top of a pier (on a single column or extending from one column of a pier to another column of the same pier).", "SPANDREL": "A tall beam placed on the facade of a building. One tall side is usually finished to provide the exterior of the building. Can be used to support joists or slab elements on its interior side.", "T_BEAM": "A beam that forms part of a slab construction and acts together with the slab which its carries. Such beams are often of T-shape (therefore the English name), but may have other shapes as well, e.g. an L-Shape or an Inverted-T-Shape.", "USERDEFINED": "User-defined linear beam element."}}, "IfcBearingType / IfcBearing": {"description": "Type of building element that is usually used to transmit loads from superstructure to substructure, and usually allowing movement (displacement or rotation) in one or more degrees of freedom. It is typically a mechanical component procured as a whole and installed on site, but in simple cases it may be built on site (composed of other building elements, element components, etc.).", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBearing.htm", "predefined_types": {"CYLINDRICAL": "The bearing functionality is provided by cylinder in a concave cylinder.", "DISK": "A disk bearing consist of an elastomeric disc between two metal plates.", "ELASTOMERIC": "A pad bearing which carries vertical load by contact stresses between a sheet of sliding material and a mating surface that permits movements by sliding and accommodates rotation by deformation of the elastomer.", "GUIDE": "A bearing that ensures that the structure maintains the correct location or expansion/contraction path and takes no vertical load. Includes also restraint bearings.", "NOTDEFINED": "Undefined bearing element.", "POT": "A bearing which carries vertical load by compression of an (elastomeric) disc confined in a (steel) cylinder and which accommodates rotations by deformations of the disc.", "ROCKER": "The bearing functionality is provided by a rocker construction. Includes line rocker and point rocker bearings.", "ROLLER": "The bearing functionality is provided by one or more rollers that are placed between two plates.", "SPHERICAL": "The bearing functionality is provided by convex dome in a concave basin.", "USERDEFINED": "User-defined bearing element."}}, "IfcBoilerType / IfcBoiler": {"description": "A boiler is a closed, pressure-rated vessel in which water or other fluid is heated using an energy source such as natural gas, heating oil, or electricity. The fluid in the vessel is then circulated out of the boiler for use in various processes or heating applications.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBoiler.htm", "predefined_types": {"NOTDEFINED": "Undefined Boiler type.", "STEAM": "Steam boiler.", "USERDEFINED": "User-defined Boiler type.", "WATER": "Water boiler."}}, "IfcBorehole": {"description": "Representation of the concept of a linear geological and geotechnical model, usually an interpretation but sometimes created direct from ground penetrating measurement\nThe assembly may contain one of more strata and other elements such as capping and lining. The contained subtypes of IfcGeotechnicalStratum will have shape representations made from straight or bent tubes reflecting the bore diameter, or discs if a 'Yabuki' top surface model is being used.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBorehole.htm", "predefined_types": {}}, "IfcBuildingElementPartType / IfcBuildingElementPart": {"description": "IfcBuildingElementPart represents major components as subordinate parts of a building element. Typical usage examples include precast concrete sandwich walls, where the layers may have different geometry representations. In this case the layered material representation does not sufficiently describe the element. Each layer is represented by an own instance of the IfcBuildingElementPart with its own geometry description.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBuildingElementPart.htm", "predefined_types": {"APRON": "A form of scour protection consisting of timber, concrete, riprap, paving, or other construction placed adjacent to abutments and piers to prevent undermining.", "ARMOURUNIT": "A large quarry stone or concrete shaped unit used as erosion prevention on slopes such as revetments and breakwaters. These units are grouped together into a Course layer.", "INSULATION": "The part provides thermal insulation, for example as insulation layer between wall panels in sandwich walls or as infill in stud walls.", "NOTDEFINED": "Undefined accessory.", "PRECASTPANEL": "The part is a precast panel, usually as an internal or external layer in a sandwich wall panel.", "SAFETYCAGE": "Safety cages are an assembly of circular and vertical bars that are fastened to the stiles of fixed ladders and are arranged to enclose the path of a worker when climbing the ladder. Ladders so enclosed are also known as caged or hooped ladders.", "USERDEFINED": "User-defined accessory."}}, "IfcBuildingElementProxyType / IfcBuildingElementProxy": {"description": "The IfcBuildingElementProxy is a proxy definition that provides the same functionality as subtypes of IfcBuildingElement, but without having a predefined meaning of the special type of building element it represents.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBuildingElementProxy.htm", "predefined_types": {"COMPLEX": "Not used - kept for upward compatibility.", "ELEMENT": "Not used - kept for upward compatibility.", "NOTDEFINED": "Undefined building element proxy.", "PARTIAL": "Not used - kept for upward compatibility.", "PROVISIONFORSPACE": "", "PROVISIONFORVOID": "", "USERDEFINED": "User-defined building element proxy."}}, "IfcBuiltElementType / IfcBuiltElement / IfcEarthworksElement / IfcEarthworksFill / IfcReinforcedSoil": {"description": "The built element comprises all elements that are primarily part of the construction of a built facility, i.e., its structural and space separating system. Built elements are all physically existent and tangible things.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBuiltElement.htm", "predefined_types": {"BACKFILL": "", "COUNTERWEIGHT": "", "EMBANKMENT": "", "NOTDEFINED": "", "SLOPEFILL": "", "SUBGRADE": "", "SUBGRADEBED": "", "TRANSITIONSECTION": "", "USERDEFINED": "", "DYNAMICALLYCOMPACTED": "", "GROUTED": "", "REPLACED": "", "ROLLERCOMPACTED": "", "SURCHARGEPRELOADED": "", "VERTICALLYDRAINED": ""}}, "IfcBurnerType / IfcBurner": {"description": "A burner is a device that converts fuel into heat through combustion. It includes gas, oil, and wood burners.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcBurner.htm", "predefined_types": {"NOTDEFINED": "Undefined burner type.", "USERDEFINED": "User-defined burner type."}}, "IfcCableCarrierFittingType / IfcCableCarrierFitting": {"description": "A cable carrier fitting is a fitting that is placed at junction or transition in a cable carrier system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCableCarrierFitting.htm", "predefined_types": {"BEND": "A fitting that changes the route of the cable carrier.", "CONNECTOR": "Connector fitting, typically used to join two ports together within a flow distribution system (e.g., a coupling used to join two duct segments).", "CROSS": "A fitting at which two branches are taken from the main route of the cable carrier simultaneously.", "JUNCTION": "A fitting with typically more than two ports used to redistribute flow among the ports and/or to change the direction of flow between connected elements (e.g, tee, cross, wye, etc.).", "NOTDEFINED": "Undefined type.", "REDUCER": "", "TEE": "A fitting at which a branch is taken from the main route of the cable carrier.", "TRANSITION": "A fitting with typically two ports having different shapes or sizes. Can also be used to change the direction of flow between connected elements.", "USERDEFINED": "User-defined type."}}, "IfcCableCarrierSegmentType / IfcCableCarrierSegment": {"description": "A cable carrier segment is a flow segment that is specifically used to carry and support cabling.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCableCarrierSegment.htm", "predefined_types": {"CABLEBRACKET": "A cable bracket is a horizontal cable support fixed at one end only, spaced at intervals, on which cables rest.", "CABLELADDERSEGMENT": "An open carrier segment on which cables are carried on a ladder structure.", "CABLETRAYSEGMENT": "A (typically) open carrier segment onto which cables are laid.", "CABLETRUNKINGSEGMENT": "An enclosed carrier segment with one or more compartments into which cables are placed.", "CATENARYWIRE": "A catenary wire is a longitudinal wire supporting the grooved contact wires either directly or indirectly. Note: definition from UIC 719-1.", "CONDUITSEGMENT": "An enclosed tubular carrier segment through which cables are pulled.", "DROPPER": "A dropper is a cable carrier used to suspend cable from another cable. It could also conduct electricity.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type."}}, "IfcCableFittingType / IfcCableFitting": {"description": "A cable fitting is a fitting that is placed at a junction, transition or termination in a cable system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCableFitting.htm", "predefined_types": {"CONNECTOR": "A fitting that joins two cable segments of the same connector type (though potentially different gender).", "ENTRY": "A fitting that begins a cable segment at a non-electrical element such as a grounding clamp attached to a pipe.", "EXIT": "A fitting that ends a cable segment at a non-electrical element such as a grounding clamp attached to a pipe or to the ground.", "FANOUT": "A fan out is a special cable fitting that provides a safe transition from multi-fiber cable units to individual fibers.", "JUNCTION": "A fitting that joins three or more segments of arbitrary connector types for signal splitting or multiplexing.", "NOTDEFINED": "Undefined type.", "TRANSITION": "A fitting that joins two cable segments of different connector types.", "USERDEFINED": "User-defined type."}}, "IfcCableSegmentType / IfcCableSegment": {"description": "A cable segment is a flow segment used to carry electrical power, data, or telecommunications signals.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCableSegment.htm", "predefined_types": {"BUSBARSEGMENT": "Electrical conductor that makes a common connection between several electrical circuits. Properties of a busbar are the same as those of a cable segment and are captured by the cable segment property set.", "CABLESEGMENT": "Cable with a specific purpose to lead electric current within a circuit or any other electric construction. Includes all types of electric cables, mainly several core segments or conductor segments wrapped together.", "CONDUCTORSEGMENT": "A single linear element within a cable or an exposed wire (such as for grounding) with the specific purpose to lead electric current, data, or a telecommunications signal.", "CONTACTWIRESEGMENT": "An electric conductor of an overhead contact line with which the current collectors make contact. Note: definition from IEC60050 811-33-15.", "CORESEGMENT": "A self contained element of a  cable that comprises one or more conductors and sheathing.The core of one lead is normally single wired or multiwired which are intertwined.", "FIBERSEGMENT": "A fiber segment is an individual optical fiber used in telecommunication systems to transmit data by means of optical signals.", "FIBERTUBE": "A fiber tube is semi-rigid hollow plastic tube with a very small radius that houses and protects a certain number of optical fiber segments. An optical cable segment may contain many fiber tubes.", "NOTDEFINED": "Undefined type.", "OPTICALCABLESEGMENT": "An optical cable segment is a cable segment that contains a variable number of optical fiber segments.", "STITCHWIRE": "A stitch wire consists of auxiliary wires and different components (clamp) used in stitched suspension.", "USERDEFINED": "User-defined type.", "WIREPAIRSEGMENT": "A pair of conductors contained in a copper cable. The pair is always used together to form a circuit to transmit data by means of electric signals."}}, "IfcCaissonFoundationType / IfcCaissonFoundation": {"description": "CaissonFoundation essentially is a hollow box that can be either open or closed.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCaissonFoundation.htm", "predefined_types": {"CAISSON": "Closed box.", "NOTDEFINED": "Undefined caisson element.", "USERDEFINED": "User-defined caisson foundation element.", "WELL": "Open box."}}, "IfcChillerType / IfcChiller": {"description": "A chiller is a device used to remove heat from a liquid via a vapor-compression or absorption refrigeration cycle to cool a fluid, typically water or a mixture of water and glycol. The chilled fluid is then used to cool and dehumidify air in a building.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcChiller.htm", "predefined_types": {"AIRCOOLED": "Air cooled chiller.", "HEATRECOVERY": "Heat recovery chiller.", "NOTDEFINED": "Undefined chiller type.", "USERDEFINED": "User-defined chiller type.", "WATERCOOLED": "Water cooled chiller."}}, "IfcChimneyType / IfcChimney": {"description": "Chimneys are typically vertical, or as near as vertical, parts of the construction of a building and part of the building fabric. Often constructed by pre-cast or insitu concrete, today seldom by bricks.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcChimney.htm", "predefined_types": {"NOTDEFINED": "", "USERDEFINED": ""}}, "IfcCivilElementType / IfcCivilElement": {"description": "An IfcCivilElement is a generalization of all elements within a civil engineering works that cannot be represented as BuildingElements, DistributionElements or GeographicElements. Depending on the context of the construction project, included building work, such as buildings or factories, are represented as a collection of IfcBuildingElement's, distribution systems, such as piping or drainage, are represented as a collection of IfcDistributionElement's, and other geographic elements, such as trees, light posts, traffic signs etc. are represented as IfcGeographicElement's.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCivilElement.htm", "predefined_types": {}}, "IfcCoilType / IfcCoil": {"description": "A coil is a device used to provide heat transfer between non-mixing media. A common example is a cooling coil, which utilizes a finned coil in which circulates chilled water, antifreeze, or refrigerant that is used to remove heat from air moving across the surface of the coil. A coil may be used either for heating or cooling purposes by placing a series of tubes (the coil) carrying a heating or cooling fluid into an airstream. The coil may be constructed from tubes bundled in a serpentine form or from finned tubes that give a extended heat transfer surface.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCoil.htm", "predefined_types": {"DXCOOLINGCOIL": "Cooling coil using a refrigerant to cool the air stream directly.", "ELECTRICHEATINGCOIL": "Heating coil using electricity as a heating source.", "GASHEATINGCOIL": "Heating coil using gas as a heating source.", "HYDRONICCOIL": "Cooling or Heating coil that uses a hydronic fluid as a cooling or heating source.", "NOTDEFINED": "Undefined coil type.", "STEAMHEATINGCOIL": "Heating coil using steam as heating source.", "USERDEFINED": "User-defined coil type.", "WATERCOOLINGCOIL": "Cooling coil using chilled water. HYDRONICCOIL supercedes this enumerator.", "WATERHEATINGCOIL": "Heating coil using hot water as a heating source. HYDRONICCOIL supercedes this enumerator."}}, "IfcColumnType / IfcColumn": {"description": "An IfcColumn is a vertical structural or architectural member which often is aligned with a structural grid intersection. In most cases it represents a vertical, or nearly vertical, structural member that transmits, through compression, the weight of the structure above to other structural elements below. It may also represent such a member from an architectural point of view in which case it may represent a non load bearing element. Whether it is a structural load bearing element or a non-load bearing element is determined by the _Pset\\_ColumnCommon.LoadBearing_ property.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcColumn.htm", "predefined_types": {"COLUMN": "A usually vertical member that may be load bearing and requiring resistance to vertical forces by compression but also sometimes to lateral forces.", "NOTDEFINED": "Undefined linear element.", "PIERSTEM": "An individual vertical part of a pier, may be a simple column, i.e. no breakdown into segments or separate structural parts such as flanges and web(s), or may be an aggregation of segments and/or parts.", "PIERSTEM_SEGMENT": "A vertical segment of a pier column.", "PILASTER": "A column element embedded within a wall that can be required to be load bearing but may also only be used for decorative purposes.", "STANDCOLUMN": "A column transmitting vertical loads from superstructure to an arch below it.", "USERDEFINED": "User-defined linear element."}}, "IfcCommunicationsApplianceType / IfcCommunicationsAppliance": {"description": "A communications appliance transmits and receives electronic or digital information as data or sound.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCommunicationsAppliance.htm", "predefined_types": {"ANTENNA": "A transducer designed to transmit or receive electromagnetic waves.", "AUTOMATON": "A self-acting artificial device, the behaviour of which is governed either in a stepwise manner by given decision rules or continuously in time by defined relationships, while the output variables of which are created from its input and state variables. Note: definition from IEC 60050-351-42-32.", "COMPUTER": "A desktop, laptop, tablet, or other type of computer that can be moved from one place to another and connected to an electrical supply via a plugged outlet.", "FAX": "A machine that has the primary function of transmitting a facsimile copy of printed matter using a telephone line.", "GATEWAY": "A gateway connects multiple network segments with different protocols at all layers (layers 1-7) of the Open Systems Interconnection (OSI) model.", "INTELLIGENTPERIPHERAL": "An intelligent peripheral is a device that offers a variety of specialized resources according to the corresponding service logical program under the control of SCP. These resources contain the receiver of DTMF (Dual-Tone Multi-Frequency, signal generator, record notice, etc.). An intelligent peripheral provides dedicated resource functions in the intelligent network, allocates, controls and manages various dedicated resources, communicates with other entities in the network, and completes SRF resource functions as well as the maintenance, management and statistics functions of resources.", "IPNETWORKEQUIPMENT": "An IP network equipment is a device that provides IP data transmission channel for telecom subsystems or other subsystems e.g., routers, network switches or firewalls.", "LINESIDEELECTRONICUNIT": "The lineside electronic unit (LEU) is the interface between the balise and interlocking in railway. The LEU acquires the information from the interlocking, and sends the appropriate information to the balises in concordance with the lineside signalling (if available).", "MODEM": "A modem (from modulator-demodulator) is a device that modulates an analog carrier signal to encode digital information, and also demodulates such a carrier signal to decode the transmitted information.", "NETWORKAPPLIANCE": "A network appliance performs a dedicated function such as firewall protection, content filtering, load balancing, or equipment management.", "NETWORKBRIDGE": "A network bridge connects multiple network segments at the data link layer (layer 2) of the OSI model, and the term layer 2 switch is very often used interchangeably with bridge.", "NETWORKHUB": "A network hub connects multiple network segments at the physical layer (layer 1) of the OSI model.", "NOTDEFINED": "Undefined type.", "OPTICALLINETERMINAL": "An optical line terminal is a service provider endpoint of a passive or active optical network. It is the terminal equipment for connecting fiber optic trunks.", "OPTICALNETWORKUNIT": "An optical network unit is a kind of optical transmission network connection equipment which is installed at user side.", "PRINTER": "A machine that has the primary function of printing text and/or graphics onto paper or other media.", "RADIOBLOCKCENTER": "A radio block center is a specialised computing device in railway with specification for generating Movement Authorities (MA) and transmitting it to trains. It gets information from signalling control and from the trains in its section.", "REPEATER": "A repeater is an electronic device that receives a signal and retransmits it at a higher level and/or higher power, or onto the other side of an obstruction, so that the signal can cover longer distances without degradation.", "ROUTER": "A router is a networking device whose software and hardware are usually tailored to the tasks of routing and forwarding information. For example, on the Internet, information is directed to various paths by routers.", "SCANNER": "A machine that has the primary function of scanning the content of printed matter and converting it to digital format that can be stored in a computer.", "TELECOMMAND": "A system sending command to control and monitor the switches and circuit breakers or systems directly or not connected (e.g. via wires) within the traction power system remotely.", "TELEPHONYEXCHANGE": "A telephony exchange is a device that ensures the routing of telephone calls and communications.", "TRANSITIONCOMPONENT": "A transition component is a minor active device that converts electric signals to optical signals at the sender, and converts optical signals to electric signals at the receiver.", "TRANSPONDER": "A transponder is a communication, monitoring, or control device that, upon receiving a signal, emits a different signal in response. Transponders can be either passive or active (e.g., electronic beacon, balise).", "TRANSPORTEQUIPMENT": "A transport equipment is a network element responsible for providing functionality of transport, multiplexing, switching, management and supervision of transmission channels between different hosts. The data transport service uses three specific metrics: the bandwidth, the jitter, and the packet loss rate.", "USERDEFINED": "User-defined type."}}, "IfcCompressorType / IfcCompressor": {"description": "A compressor is a device that compresses a fluid typically used in a refrigeration circuit.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCompressor.htm", "predefined_types": {"BOOSTER": "Positive-displacement reciprocating compressor where pressure is increased by a booster.", "DYNAMIC": "The pressure of refrigerant vapor is increased by a continuous transfer of angular momentum from a rotating member to the vapor followed by conversion of this momentum into static pressure.", "HERMETIC": "Positive-displacement reciprocating compressor where the motor and compressor are contained within the same housing, with the motor shaft integral with the compressor crankshaft and the motor in contact with refrigerant.", "NOTDEFINED": "Undefined compressor type.", "OPENTYPE": "Positive-displacement reciprocating compressor where the shaft extends through a seal in the crankcase for an external drive.", "RECIPROCATING": "Positive-displacement compressor using a piston driven by a connecting rod from a crankshaft.", "ROLLINGPISTON": "Positive-displacement rotary compressor using a roller mounted on the eccentric of a shaft with a single vane in the nonrotating cylindrical housing.", "ROTARY": "Positive-displacement compressor using a roller or rotor device.", "ROTARYVANE": "Positive-displacement rotary compressor using a roller mounted on the eccentric of a shaft with multiple vanes in the nontotating cylindrical housing.", "SCROLL": "Positive-displacement compressor using two inter-fitting, spiral-shaped scroll members.", "SEMIHERMETIC": "Positive-displacement reciprocating compressor where the hermetic compressors use bolted construction amenable to field repair.", "SINGLESCREW": "Positive-displacement rotary compressor using a single cylindrical main rotor that works with a pair of gate rotors.", "SINGLESTAGE": "Positive-displacement reciprocating compressor where vapor is compressed in a single stage.", "TROCHOIDAL": "Positive-displacement compressor using a rolling motion of one circle outside or inside the circumference of a basic circle and produce either epitrochoids or hypotrochoids.", "TWINSCREW": "Positive-displacement rotary compressor using two mating helically grooved rotors, male (lobes) and female (flutes) in a stationary housing with inlet and outlet gas ports.", "USERDEFINED": "User-defined compressor type.", "WELDEDSHELLHERMETIC": "Positive-displacement reciprocating compressor where the motor compressor is mounted inside a steel shell, which, in turn is sealed by welding."}}, "IfcCondenserType / IfcCondenser": {"description": "A condenser is a device that is used to dissipate heat, typically by condensing a substance such as a refrigerant from its gaseous to its liquid state.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCondenser.htm", "predefined_types": {"AIRCOOLED": "A condenser in which heat is transferred to an air-stream.", "EVAPORATIVECOOLED": "A condenser that is cooled evaporatively.", "NOTDEFINED": "Undefined condenser type.", "USERDEFINED": "User-defined condenser type.", "WATERCOOLED": "Water-cooled condenser with unspecified operation.", "WATERCOOLEDBRAZEDPLATE": "Water-cooled condenser with plates brazed together to form an assembly of separate channels.", "WATERCOOLEDSHELLCOIL": "Water-cooled condenser with cooling water circulated through one or more continuous or assembled coils contained within the shell.", "WATERCOOLEDSHELLTUBE": "Water-cooled condenser with cooling water circulated through one or more tubes contained within the shell.", "WATERCOOLEDTUBEINTUBE": "Water-cooled condenser consisting of one or more assemblies of two tubes, one within the other."}}, "IfcControllerType / IfcController": {"description": "A controller is a device that monitors inputs and controls outputs within a building automation system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcController.htm", "predefined_types": {"FLOATING": "Output increases or decreases at a constant or accelerating rate.", "MULTIPOSITION": "Output is discrete value, can be one of three or more values.", "NOTDEFINED": "Undefined type.", "PROGRAMMABLE": "Output is programmable such as Discrete Digital Control (DDC).", "PROPORTIONAL": "Output is proportional to the control error and optionally time integral and derivative.", "TWOPOSITION": "Output can be either on or off.", "USERDEFINED": "User-defined type."}}, "IfcConveyorSegmentType / IfcConveyorSegment": {"description": "A conveyor segment defines an occurrence of a flow segment/ continuous run within a conveyor system that joins two sections of the system. these can utilise different carrying methods such as belt, rope, chain, screw etc.\n> NOTE  Definition according to ISO6707-1: machine that continuously transports material or objects along a gentle slope using an endless belt, rope or chain, or rollers.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcConveyorSegment.htm", "predefined_types": {"BELTCONVEYOR": "An endless belt for carrying material without stretching.", "BUCKETCONVEYOR": "A conveyor in the form of connected buckets or segments that move in a continuous loop", "CHUTECONVEYOR": "Gravity-operated conveyor where media descends through a trough or chute.", "NOTDEFINED": "Undefined type.", "SCREWCONVEYOR": "composed of a longitudinal screw in a trough or pipe that rotates to force media through the segment", "USERDEFINED": "User-defined type"}}, "IfcCooledBeamType / IfcCooledBeam": {"description": "A cooled beam (or chilled beam) is a device typically used to cool air by circulating a fluid such as chilled water through exposed finned tubes above a space. Typically mounted overhead near or within a ceiling, the cooled beam uses convection to cool the space below it by acting as a heat sink for the naturally rising warm air of the space. Once cooled, the air naturally drops back to the floor where the cycle begins again.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCooledBeam.htm", "predefined_types": {"ACTIVE": "An active or ventilated cooled beam provides cooling (and heating) but can also function as an air terminal in a ventilation system.", "NOTDEFINED": "Undefined cooled beam type.", "PASSIVE": "A passive or static cooled beam provides cooling (and heating) to a room or zone.", "USERDEFINED": "User-defined cooled beam type."}}, "IfcCoolingTowerType / IfcCoolingTower": {"description": "A cooling tower is a device which rejects heat to ambient air by circulating a fluid such as water through it to reduce its temperature by partial evaporation.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCoolingTower.htm", "predefined_types": {"MECHANICALFORCEDDRAFT": "Air flow is produced by a mechanical device, typically one or more fans, located on the inlet air side of the cooling tower.", "MECHANICALINDUCEDDRAFT": "Air flow is produced by a mechanical device, typically one or more fans, located on the air outlet side of the cooling tower.", "NATURALDRAFT": "Air flow is produced naturally.", "NOTDEFINED": "Undefined cooling tower type.", "USERDEFINED": "User-defined cooling tower type."}}, "IfcCourseType / IfcCourse": {"description": "A built element whose length greatly exceeds its thickness and often also its width, usually of a single material laid on site on top of another horizontal or nearly horizontal built element. A course is distinctive from a earthworks element in that a course is a graded granular (which can be bound or unbound) material that is generally processed in some fashion, where as earthworks elements are soil earthen based structure that can be formed by removal and transport of general ground material.\nStructurally a course does not have capacity to carry loads over open span, or to be removed or replaced as a single unit. examples of courses include:\n* Graded aggregate layers\n* Graded sand layers\n* Cement bounded material (CBM)\n* Asphalt layers\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCourse.htm", "predefined_types": {"ARMOUR": "An Aggregate layer whose primary function is to protect against erosion of the underlying material by water e.g. riprap.", "BALLASTBED": "Layer composed of broken stones under the sleepers.", "CORE": "A core course is the bulk internal structure of aggregate structures.", "FILTER": "An Intermediate layer whose primary function is to prevent the washing through of fine materials.", "NOTDEFINED": "Undefined type.", "PAVEMENT": "A layer within a pavement structure that forms a paved area or road.", "PROTECTION": "Layer with the primary task to provide protection against erosion and scour.", "USERDEFINED": "User-defined type"}}, "IfcCoveringType / IfcCovering": {"description": "A covering is an element which covers some part of another element and is fully dependent on that other element. The IfcCovering defines the occurrence of a covering type, that (if given) is expressed by the IfcCoveringType.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCovering.htm", "predefined_types": {"CEILING": "The covering is used to represent a ceiling.", "CLADDING": "The covering is used to represent a cladding.", "COPING": "A protective capping or covering of a wall or a parapet.", "FLOORING": "The covering is used to represent a flooring.", "INSULATION": "The covering is used to insulate an element for thermal or acoustic purposes.", "MEMBRANE": "An impervious layer that could be used for e.g. roof covering (below tiling - that may be known as sarking etc.) or as a damp proof course membrane; also, waterproofing material on a bridge structure (typically on top of bridge slab).", "MOLDING": "The covering is used to represent a molding being a strip of material to cover the transition of surfaces (often between wall cladding and ceiling).", "NOTDEFINED": "Undefined type of covering.", "ROOFING": "The covering is used to represent a roof covering.", "SKIRTINGBOARD": "The covering is used to represent a skirting board being a strip of material to cover the transition between the wall cladding and the flooring.", "SLEEVING": "The covering is used to isolate a distribution element from a space in which it is contained.", "TOPPING": "A layer of material used for leveling or flattening a surface.", "USERDEFINED": "User defined type of covering.", "WRAPPING": "The covering is used for wrapping particularly of distribution elements using tape."}}, "IfcCurtainWallType / IfcCurtainWall": {"description": "A curtain wall is a wall of a building which is an assembly of components, hung from the edge of the floor/roof structure rather than bearing on a floor. Curtain wall is represented as a building element assembly and implemented as a subtype of IfcBuildingElement that uses an IfcRelAggregates relationship. A curtain wall is often external, but using Pset_CurtainWallCommon.IsExternal can be used to define interior curtain walls.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcCurtainWall.htm", "predefined_types": {"NOTDEFINED": "", "USERDEFINED": ""}}, "IfcDamperType / IfcDamper": {"description": "A damper typically participates in an HVAC duct distribution system and is used to control or modulate the flow of air.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDamper.htm", "predefined_types": {"BACKDRAFTDAMPER": "Damper used for purposes of manually balancing pressure differences.  Commonly operated by mechanical adjustment.", "BALANCINGDAMPER": "Backdraft damper used to restrict the movement of air in one direction.  Commonly operated by mechanical spring.", "BLASTDAMPER": "Blast damper used to prevent protect occupants and equipment against overpressures resultant of an explosion.  Commonly operated by mechanical spring.", "CONTROLDAMPER": "Control damper used to modulate the flow of air by adjusting the position of the blades.  Commonly operated by an actuator of a building automation system.", "FIREDAMPER": "Fire damper used to prevent the spread of fire for a specified duration.  Commonly operated by fusable link that melts above a certain temperature.", "FIRESMOKEDAMPER": "Combination fire and smoke damper used to prevent the spread of fire and smoke.  Commonly operated by a fusable link and a smoke detector.", "FUMEHOODEXHAUST": "Fume hood exhaust damper.  Commonly operated by actuator.", "GRAVITYDAMPER": "Gravity damper closes from the force of gravity.  Commonly operated by gravitational weight.", "GRAVITYRELIEFDAMPER": "Gravity-relief damper used to allow air to move upon a buildup of enough pressure to overcome the gravitational force exerted upon the damper blades.  Commonly operated by gravitational weight.", "NOTDEFINED": "Undefined damper.", "RELIEFDAMPER": "Relief damper used to allow air to move upon a buildup of a specified pressure differential.  Commonly operated by mechanical spring.", "SMOKEDAMPER": "Smoke damper used to prevent the spread of smoke.  Commonly operated by a smoke detector of a building automation system.", "USERDEFINED": "User-defined damper."}}, "IfcDeepFoundationType / IfcDeepFoundation": {"description": "Deep foundation is a type of foundation that transfers loads deeper than shallow foundation below the soft soils not capable of bearing the above structure. Depending on the soil strength it might have to reach down to the rock layer.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDeepFoundation.htm", "predefined_types": {}}, "IfcDiscreteAccessoryType / IfcDiscreteAccessory": {"description": "A discrete accessory is a representation of different kinds of accessories included in or added to elements.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDiscreteAccessory.htm", "predefined_types": {"ANCHORPLATE": "An accessory consisting of a steel plate, shear stud connectors or welded-on rebar which is embedded into the surface of a concrete element so that other elements can be welded or bolted onto it later.", "BIRDPROTECTION": "A device that prevents a sitting down of birds at electrically critical points and thus birds are protected against electrical shocks and disturbances by short circuit are avoided.", "BRACKET": "An L-shaped or similarly shaped accessory attached in a corner between elements to hold them together or to carry a secondary element.", "CABLEARRANGER": "A cable arranger is a flexible accessory or a part of a component placed around cables to arrange and minimize flexing of them at the point where it is placed.", "ELASTIC_CUSHION": "A track elastic cushion is a kind of layer set on grooved sides of a concrete base, which is used for mitigating the impact of longitudinal and lateral load on track structures. A track elastic cushion shall only appear in ballastless track structures.", "EXPANSION_JOINT_DEVICE": "Assembly connection element between construction elements to allow for thermic differential expansions.", "FILLER": "Sealant, gap filler rod, packing material or other used to close a gap.", "FLASHING": "Construction material used to manage the passage of water around objects.", "INSULATOR": "A device designed to support and insulate a conductive element. Note: definition from IEC 151-15-39.", "LOCK": "A lock is a mechanical or electronic fastening device that is released either by a physical object (e.g., key, fingerprint, RFID card, security token etc.), by supplying secret information (e.g., number permutation, password), or by a combination thereof.", "NOTDEFINED": "Undefined accessory.", "PANEL_STRENGTHENING": "A component that minimizes pump effects of the substructure.", "POINTMACHINEMOUNTINGDEVICE": "Point machine mounting device.", "POINT_MACHINE_LOCKING_DEVICE": "Point machine locking device.", "RAILBRACE": "A rail component that prevents rails from tipping and twisting.", "RAILPAD": "A non-metallic pad placed between rail and baseplate or rail and sleeper, bearer or slab. Note: definition from EN 13481-1.", "RAIL_LUBRICATION": "A device that prevents wearing of the rails throughout the flange of wheel to reduce noise emissions. It is often located at inner side of the outer rail in a curve or near turnouts (depends on function wearing or noise reduction).", "RAIL_MECHANICAL_EQUIPMENT": "A rail mechanical equipment is a mechnical equipment installed at railside, like blocking device, speed regulator, bias loaded inspector, track scale or controllable retarder.", "SHOE": "A column shoe or a beam shoe (beam hanger) used to support or secure an element.", "SLIDINGCHAIR": "A component which supports and retains the stock rail and a flat surface upon which the foot of the switch rail slides.", "SOUNDABSORPTION": "A component in the track for sound absorption and may also absorb vibrations. It is often used in combination with slab tracks.", "TENSIONINGEQUIPMENT": "An equipment used to maintain the tension of conductors or cables.", "USERDEFINED": "User-defined accessory."}}, "IfcDistributionBoardType / IfcDistributionBoard": {"description": "A distribution board is a flow controller in which instances of electrical or communication devices are brought together at a single place for a particular purpose.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDistributionBoard.htm", "predefined_types": {"CONSUMERUNIT": "A distribution point on the incoming electrical supply, typically in domestic premises, at which protective devices are located.", "DISPATCHINGBOARD": "A distribution point at which voice and data communication signals are managed between communication devices.", "DISTRIBUTIONBOARD": "A distribution point at which connections are made for distribution of electrical circuits usually through protective devices.", "DISTRIBUTIONFRAME": "A distribution frame is used to interconnect and manage wiring between active equipment and subscriber. It might be composed of multiple distribution boards and other components.", "MOTORCONTROLCENTRE": "A distribution point at which starting and control devices for major plant items are located.", "NOTDEFINED": "Undefined type.", "SWITCHBOARD": "A distribution point at which switching devices are located.", "USERDEFINED": "User-defined type"}}, "IfcDistributionChamberElementType / IfcDistributionChamberElement": {"description": "A distribution chamber element defines a place at which distribution systems and their constituent elements may be inspected or through which they may travel.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDistributionChamberElement.htm", "predefined_types": {"FORMEDDUCT": "Space formed in the ground for the passage of pipes, cables, ducts.", "INSPECTIONCHAMBER": "Chamber constructed on a drain, sewer or pipeline with a removable cover that permits visible inspection.", "INSPECTIONPIT": "Recess or chamber formed to permit access for inspection of substructure and services.", "MANHOLE": "Chamber constructed on a drain, sewer or pipeline with a removable cover that permits the entry of a person.", "METERCHAMBER": "Chamber that houses a meter(s).", "NOTDEFINED": "Undefined chamber type.", "SUMP": "Recessed or small chamber into which liquid is drained to facilitate its collection for removal.", "TRENCH": "Excavated chamber, the length of which typically exceeds the width.", "USERDEFINED": "User-defined chamber type.", "VALVECHAMBER": "Chamber that houses a valve(s)."}}, "IfcDistributionElementType / IfcDistributionControlElement / IfcDistributionElement / IfcDistributionFlowElement / IfcEnergyConversionDevice / IfcFlowController / IfcFlowFitting / IfcFlowMovingDevice / IfcFlowSegment / IfcFlowStorageDevice / IfcFlowTerminal / IfcFlowTreatmentDevice": {"description": "The distribution element IfcDistributionControlElement defines occurrence elements of a building automation control system that are used to impart control over elements of a distribution system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDistributionControlElement.htm", "predefined_types": {}}, "IfcDoorType / IfcDoor": {"description": "The door is a built element that is predominately used to provide controlled access for people, goods, animals and vehicles. It includes constructions with hinged, pivoted, sliding, and additionally revolving and folding operations. A door can:", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDoor.htm", "predefined_types": {"BOOM_BARRIER": "A boom barrier (also known as a boom gate) is a bar, or pole pivoted to allow the boom to block vehicular or pedestrian access through a controlled point.", "DOOR": "A standard door usually within a wall opening, as a door panel in a curtain wall, or as a \"free standing\" door.", "GATE": "A gate is a point of entry into a space usually within an opening in a fence. Or as a \"free standing\" gate.", "NOTDEFINED": "Undefined door element.", "TRAPDOOR": "A special door that lies horizonally in a slab opening. Often used for accessing cellar or attic.", "TURNSTILE": "A mechanical gate consisting of revolving arms, allowing only one person at a time to pass through.", "USERDEFINED": "User-defined door element."}}, "IfcDuctFittingType / IfcDuctFitting": {"description": "A duct fitting is a junction or transition in a ducted flow distribution system or used to connect duct segments, resulting in changes in flow characteristics to the fluid such as direction and flow rate.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDuctFitting.htm", "predefined_types": {"BEND": "A fitting with typically two ports used to change the direction of flow between connected elements.", "CONNECTOR": "Connector fitting, typically used to join two ports together within a flow distribution system (e.g., a coupling used to join two duct segments).", "ENTRY": "Entry fitting, typically unconnected at one port and connected to a flow distribution system at the other (e.g., an outside air duct system intake opening).", "EXIT": "Exit fitting, typically unconnected at one port and connected to a flow distribution system at the other (e.g., an exhaust air discharge opening).", "JUNCTION": "A fitting with typically more than two ports used to redistribute flow among the ports and/or to change the direction of flow between connected elements (e.g, tee, cross, wye, etc.).", "NOTDEFINED": "Undefined fitting.", "OBSTRUCTION": "A fitting with typically two ports used to obstruct or restrict flow between the connected elements (e.g., screen, perforated plate, etc.).", "TRANSITION": "A fitting with typically two ports having different shapes or sizes. Can also be used to change the direction of flow between connected elements.", "USERDEFINED": "User-defined fitting."}}, "IfcDuctSegmentType / IfcDuctSegment": {"description": "A duct segment is used to typically join two sections of duct network.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDuctSegment.htm", "predefined_types": {"FLEXIBLESEGMENT": "A flexible segment is a continuous non-linear segment of duct that can be deformed and change the direction of flow.", "NOTDEFINED": "Undefined segment.", "RIGIDSEGMENT": "A rigid segment is a continuous linear segment of duct that cannot be deformed.", "USERDEFINED": "User-defined segment."}}, "IfcDuctSilencerType / IfcDuctSilencer": {"description": "A duct silencer is a device that is typically installed inside a duct distribution system for the purpose of reducing the noise levels from air movement, fan noise, etc. in the adjacent space or downstream of the duct silencer device.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcDuctSilencer.htm", "predefined_types": {"FLATOVAL": "Flat-oval shaped duct silencer type.", "NOTDEFINED": "Undefined duct silencer type.", "RECTANGULAR": "Rectangular shaped duct silencer type.", "ROUND": "Round duct silencer type.", "USERDEFINED": "User-defined duct silencer type."}}, "IfcEarthworksCut": {"description": "The resulting void from modification of existing terrain or road structure by excavation or by other means of removing material.\nNOTE Definition from ISO 6707-1: void that results from bulk excavation of material.\nNOTE The material excavated and either used as fill or discarded as waste is not modelled as Cut, but may be handled as a different concept (Resource) in the future.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcEarthworksCut.htm", "predefined_types": {"BASE_EXCAVATION": "Excavation for basements of buildings, abutments of bridges or similar structures either partially or completely below ground level.", "CUT": "Excavation where soil or rock below topsoil is cut to the depth required for the construction of facilities such as roads and railways. The removed material can be used as fill (IfcEarthworksElement) for embankments or to form a level surface on which to build.", "DREDGING": "Underwater excavation to recover material or to create a greater depth of water.", "EXCAVATION": "General type of excavation when more accurate type is not specified.", "NOTDEFINED": "Undefined type.", "OVEREXCAVATION": "Excavation that goes beyond the depth required for construction, in order to replace unsuitable material.", "PAVEMENTMILLING": "Removal of expired material from top of pavement to be replaced by new material.", "STEPEXCAVATION": "Removal of the soft part of the existing road slope, where it is dug into steps, when widening a road.", "TOPSOILREMOVAL": "Excavation where the topmost layer of soil containing organic material is cut or stripped. The removed topsoil can be used as fill (EarthworksElement) e.g. where planting is planned.", "TRENCH": "Excavation whose length greatly exceeds the depth and width. Trench is typically excavated for strip foundations or for buried services such as drainage or cabling.", "USERDEFINED": "User-defined type"}}, "IfcElectricApplianceType / IfcElectricAppliance": {"description": "An electric appliance is a device intended for consumer usage that is powered by electricity.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricAppliance.htm", "predefined_types": {"DISHWASHER": "An appliance that has the primary function of washing dishes.", "ELECTRICCOOKER": "An electrical appliance that has the primary function of cooking food (including oven, hob, grill).", "FREESTANDINGELECTRICHEATER": "An electrical appliance that is used occasionally to provide heat. A freestanding electric heater is a 'plugged' appliance whose load may be removed from an electric circuit.", "FREESTANDINGFAN": "An electrical appliance that is used occasionally to provide ventilation. A freestanding fan is a 'plugged' appliance whose load may be removed from an electric circuit.", "FREESTANDINGWATERCOOLER": "A small, local electrical appliance for cooling water. A freestanding water cooler is a 'plugged' appliance whose load may be removed from an electric circuit.", "FREESTANDINGWATERHEATER": "A small, local electrical appliance for heating water. A freestanding water heater is a 'plugged' appliance whose load may be removed from an electric circuit.", "FREEZER": "An electrical appliance that has the primary function of storing food at temperatures below the freezing point of water.", "FRIDGE_FREEZER": "An electrical appliance that combines the functions of a freezer and a refrigerator through the provision of separate compartments.", "HANDDRYER": "An electrical appliance that has the primary function of drying hands.", "KITCHENMACHINE": "A specialized appliance used in commercial kitchens such as a mixer.", "MICROWAVE": "An electrical appliance that has the primary function of cooking food using microwaves.", "NOTDEFINED": "Undefined type.", "PHOTOCOPIER": "A machine that has the primary function of reproduction of printed matter.", "REFRIGERATOR": "An electrical appliance that has the primary function of storing food at low temperature but above the freezing point of water.", "TUMBLEDRYER": "An electrical appliance that has the primary function of drying clothes.", "USERDEFINED": "User-defined type.", "VENDINGMACHINE": "An appliance that stores and vends goods including food, drink, tickets, and goods of various types.", "WASHINGMACHINE": "An appliance that has the primary function of washing clothes."}}, "IfcElectricDistributionBoardType / IfcElectricDistributionBoard": {"description": "A distribution board is a flow controller in which instances of electrical devices are brought together at a single place for a particular purpose.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricDistributionBoard.htm", "predefined_types": {"CONSUMERUNIT": "A distribution point on the incoming electrical supply, typically in domestic premises, at which protective devices are located.", "DISTRIBUTIONBOARD": "A distribution point at which connections are made for distribution of electrical circuits usually through protective devices.", "MOTORCONTROLCENTRE": "A distribution point at which starting and control devices for major plant items are located.", "NOTDEFINED": "Undefined type.", "SWITCHBOARD": "A distribution point at which switching devices are located.", "USERDEFINED": "User-defined type."}}, "IfcElectricFlowStorageDeviceType / IfcElectricFlowStorageDevice": {"description": "An electric flow storage device is a device in which electrical energy is stored and from which energy may be progressively released.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricFlowStorageDevice.htm", "predefined_types": {"BATTERY": "A device for storing energy in chemical form so that it can be released as electrical energy.", "CAPACITOR": "A device that stores electric charge when an external power supply is present using the electrical property of capacitance. Two-terminal device characterized essentially by its capacitance. Note: definition from IEC 60050 151-13-28.", "CAPACITORBANK": "A device that stores electrical energy when an external power supply is present using the electrical property of capacitance.", "COMPENSATOR": "A device that is used to fix or adjust the parameter of electric energy, such as voltage loss, power factor and so on.", "HARMONICFILTER": "A device that constantly injects currents that precisely correspond to the harmonic components drawn by the load.", "INDUCTOR": "A device used in circuits or power systems due to their inductance, acting as a component of electric storage device.", "INDUCTORBANK": "A device that stores electrical energy in a magnetic field using electrical property of inductance.", "NOTDEFINED": "Undefined type.", "RECHARGER": "A recharger or battery charger is a device used to put energy into a secondary cell or rechargeable battery by forcing an electric current through it.", "UPS": "A device that provides a time limited alternative source of power supply in the event of failure of the main supply.", "USERDEFINED": "User-defined type."}}, "IfcElectricFlowTreatmentDeviceType / IfcElectricFlowTreatmentDevice": {"description": "An electric flow treatment device is used to remove unwanted matter from an electric or electronic signal in a flow distribution system.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricFlowTreatmentDevice.htm", "predefined_types": {"ELECTRONICFILTER": "Linear two-port device designed to transmit spectral components of the input quantity according to a specified law, generally in order to pass the components in certain frequency bands and to attenuate those in other bands", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type"}}, "IfcElectricGeneratorType / IfcElectricGenerator": {"description": "An electric generator is an engine that is a machine for converting mechanical energy into electrical energy.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricGenerator.htm", "predefined_types": {"CHP": "Combined heat and power supply, used not only as a source of electric energy but also as a heating source for the building. It may therefore be not only part of an electrical system but also of a heating system.", "ENGINEGENERATOR": "Electrical generator with a fuel-driven engine, for example a diesel-driven emergency power supply.", "NOTDEFINED": "Undefined type.", "STANDALONE": "Electrical generator which does not include its source of kinetic energy, that is, a motor, engine, or turbine are all modeled separately.", "USERDEFINED": "User-defined type."}}, "IfcElectricMotorType / IfcElectricMotor": {"description": "An electric motor is an engine that is a machine for converting electrical energy into mechanical energy.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricMotor.htm", "predefined_types": {"DC": "A motor using either generated or rectified Direct Current (DC) power.", "INDUCTION": "An alternating current motor in which the primary winding on one member (usually the stator) is connected to the power source and a secondary winding or a squirrel-cage secondary winding on the other member (usually the rotor) carries the induced current. There is no physical electrical connection to the secondary winding, its current is induced.", "NOTDEFINED": "Undefined type.", "POLYPHASE": "A two or three-phase induction motor in which the windings, one for each phase, are evenly divided by the same number of electrical degrees.", "RELUCTANCESYNCHRONOUS": "A synchronous motor with a special rotor design which directly lines the rotor up with the rotating magnetic field of the stator, allowing for no slip under load.", "SYNCHRONOUS": "A motor that operates at a constant speed up to full load. The rotor speed is equal to the speed of the rotating magnetic field of the stator; there is no slip.", "USERDEFINED": "User-defined type."}}, "IfcElectricTimeControlType / IfcElectricTimeControl": {"description": "An electric time control is a device that applies control to the provision or flow of electrical energy over time.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElectricTimeControl.htm", "predefined_types": {"NOTDEFINED": "Undefined type.", "RELAY": "Electromagnetically operated contactor for making or breaking a control circuit.", "TIMECLOCK": "A control that causes action to occur at set times.", "TIMEDELAY": "A control that causes action to occur following a set duration.", "USERDEFINED": "User-defined type."}}, "IfcElementAssemblyType / IfcElementAssembly": {"description": "The IfcElementAssembly represents complex element assemblies aggregated from several elements, such as discrete elements, building elements, or other elements.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcElementAssembly.htm", "predefined_types": {"ABUTMENT": "A bridge abutment built up of walls, beams, slabs etc.", "ACCESSORY_ASSEMBLY": "Assembled accessories or components.", "ARCH": "A curved structure.", "BEAM_GRID": "Interconnected beams, located in one (typically horizontal) plane.", "BRACED_FRAME": "A rigid frame with additional bracing members.", "CROSS_BRACING": "A Structural linear member or assembly of members inside a box girder or between girders, typically on a pier, to resist lateral forces and transfer them to the support.", "DECK": "A platform (such as floor or bridge deck) built up of beams, slabs.", "DILATATIONPANEL": "Device which permits longitudinal relative rail movement of two adjacent rails, while maintaining correct guidance and support. Note: definition from NF EN 13232-1-2004.", "ENTRANCEWORKS": "An assembly forming the support structure of a chamber (lock, dock) gate and associated elements, plus the containment of operational equipment.", "GIRDER": "A beam-like superstructure, such as bridge main girder extending between abutments and piers built up of beams, braces (as Members) etc. - may also be an aggregation of girder segments.", "GRID": "A framework of spaced cables or bars that are parallel to or cross each other.", "MAST": "An assembly of plates, members, cables or fasteners that form a vertical structure for the support or mounting of other equipment such as lights, sonar or wireless transmitters.", "NOTDEFINED": "Undefined element assembly.", "PIER": "An intermediate support e.g. in a bridge, built up of walls, columns, beams etc.", "PYLON": "A vertical structure supporting cables in suspended or stayed structure.", "RAIL_MECHANICAL_EQUIPMENT_ASSEMBLY": "A complex assembly made up of several components like blocking device, speed regulator, bias loaded inspector, track scale or controllable retarder.", "REINFORCEMENT_UNIT": "Assembled reinforcement elements.", "RIGID_FRAME": "A structure built up of beams, columns, etc. with moment-resisting joints, such as gantry", "SHELTER": "A structure, fairly quick to setup, move or dismantle, used to give protection, especially from the weather or intrusion.", "SIGNALASSEMBLY": "An assembly to physically aggregate together one or more signal instances (and also sign instances) including any supporting structural elements such as a simple pole or a rigid frame gantry.", "SLAB_FIELD": "Slabs, laid out in one plane.", "SUMPBUSTER": "An obstacle (with oil catchment basin) installed typically in a bus lane to prevent other traffic with lower ground clearance from using it. Also Sump breaker or Sump trap.", "SUPPORTINGASSEMBLY": "An assembly intends to support Overhead Contact Line System. It includes foundation, supporting elements and suspension assembly.", "SUSPENSIONASSEMBLY": "A complex assembly of components used to suspend elements or cable segments.", "TRACKPANEL": "Trackwork ensuring the support and guidance of a vehicle along a route. It consists of assembly of rail, sleepers and fastenings.", "TRACTION_SWITCHING_ASSEMBLY": "A common assembly used to insure the switching function. It is composed of switches, control instruments and other components.", "TRAFFIC_CALMING_DEVICE": "A structure on the carriageway to control the speed of vehicles.", "TRUSS": "A structure built up of members with (quasi) pinned joint.", "TURNOUTPANEL": "Trackwork ensuring the support and guidance of a vehicle along any given route among various diverging or intersecting tracks. Note: definition from NF EN 13232-1-2004.", "USERDEFINED": "User-defined element assembly."}}, "IfcEngineType / IfcEngine": {"description": "An engine is a device that converts fuel into mechanical energy through combustion.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcEngine.htm", "predefined_types": {"EXTERNALCOMBUSTION": "Combustion is external.", "INTERNALCOMBUSTION": "Combustion is internal.", "NOTDEFINED": "Undefined engine type.", "USERDEFINED": "User-defined engine type."}}, "IfcEvaporativeCoolerType / IfcEvaporativeCooler": {"description": "An evaporative cooler is a device that cools air by saturating it with water vapor.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcEvaporativeCooler.htm", "predefined_types": {"DIRECTEVAPORATIVEAIRWASHER": "Direct evaporative air washer: Cools the air stream by evaporating water dircectly into the air stream using coolers with spray-type air washer consist of a chamber or casing containing spray nozzles, and tank for collecting spray water, and an eliminator section for removing entrained drops of water from the air.", "DIRECTEVAPORATIVEPACKAGEDROTARYAIRCOOLER": "Direct evaporative packaged rotary air cooler: Cools the air stream by evaporating water dircectly into the air stream using coolers that wet and wash the evaporative pad by rotating it through a water bath.", "DIRECTEVAPORATIVERANDOMMEDIAAIRCOOLER": "Direct evaporative random media air cooler: Cools the air stream by evaporating water dircectly into the air stream using coolers with evaporative pads, usually of aspen wood or plastic fiber/foam.", "DIRECTEVAPORATIVERIGIDMEDIAAIRCOOLER": "Direct evaporative rigid media air cooler: Cools the air stream by evaporating water dircectly into the air stream using coolers with sheets of rigid, corrugated material as the wetted surface.", "DIRECTEVAPORATIVESLINGERSPACKAGEDAIRCOOLER": "Direct evaporative slingers packaged air cooler: Cools the air stream by evaporating water dircectly into the air stream using coolers with a water slinger in an evaporative cooling section and a fan section.", "INDIRECTDIRECTCOMBINATION": "Indirect/Direct combination: Cools the air stream by evaporating water indirectly and without adding moisture into the air stream using a two-stage cooler with a first-stage indirect evaporative cooler and second-stage direct evaporative cooler.", "INDIRECTEVAPORATIVECOOLINGTOWERORCOILCOOLER": "Indirect evaporative cooling tower or coil cooler: Cools the air stream by evaporating water indirectly and without adding moisture into the air stream using a combination of a cooling tower or other evaporative water cooler with a water-to-air heat exchanger coil and water circulating pump.", "INDIRECTEVAPORATIVEPACKAGEAIRCOOLER": "Indirect evaporative package air cooler: Cools the air stream by evaporating water indirectly and without adding moisture into the air stream. On one side of the heat exchanger, the secondary air stream is cooled by evaporation, while on the other side of heat exchanger, the primary air stream (conditioned air to be supplied to the room) is sensibly cooled by the heat exchanger surfaces.", "INDIRECTEVAPORATIVEWETCOIL": "Indirect evaporative wet coil: Cools the air stream by evaporating water indirectly and without adding moisture into the air stream. Water is sprayed directly on the tubes of the heat exchanger where latent cooling takes place and the vaporization of the water on the outside of the heat exchanger tubes allows the simultaneous heat and mass transfer which removes heat from the supply air on the tube side.", "NOTDEFINED": "Undefined evaporative cooler type.", "USERDEFINED": "User-defined evaporative cooler type."}}, "IfcEvaporatorType / IfcEvaporator": {"description": "An evaporator is a device in which a liquid refrigerent is vaporized and absorbs heat from the surrounding fluid.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcEvaporator.htm", "predefined_types": {"DIRECTEXPANSION": "Direct-expansion evaporator.", "DIRECTEXPANSIONBRAZEDPLATE": "Direct-expansion evaporator where a refrigerant evaporates inside plates brazed or welded together to make up an assembly of separate channels.", "DIRECTEXPANSIONSHELLANDTUBE": "Direct-expansion evaporator where a refrigerant evaporates inside a series of baffles that channel the fluid throughout the shell side.", "DIRECTEXPANSIONTUBEINTUBE": "Direct-expansion evaporator where a refrigerant evaporates inside one or more pairs of coaxial tubes.", "FLOODEDSHELLANDTUBE": "Evaporator in which refrigerant evaporates outside tubes.", "NOTDEFINED": "Undefined evaporator type.", "SHELLANDCOIL": "Evaporator in which refrigerant evaporates inside a simple coiled tube immersed in the fluid to be cooled.", "USERDEFINED": "User-defined evaporator type."}}, "IfcFanType / IfcFan": {"description": "A fan is a device which imparts mechanical work on a gas. A typical usage of a fan is to induce airflow in a building services air distribution system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFan.htm", "predefined_types": {"CENTRIFUGALAIRFOIL": "Air flows through the impeller radially using blades that are airfoil shaped.", "CENTRIFUGALBACKWARDINCLINEDCURVED": "Air flows through the impeller radially using blades that are backward curved.", "CENTRIFUGALFORWARDCURVED": "Air flows through the impeller radially using blades that are forward curved.", "CENTRIFUGALRADIAL": "Air flows through the impeller radially using blades that are uncurved or slightly forward curved.", "NOTDEFINED": "Undefined fan type.", "PROPELLORAXIAL": "Air flows through the impeller axially and small hub-to-tip ratio impeller mounted in an orifice plate or inlet ring.", "TUBEAXIAL": "Air flows through the impeller axially with reduced tip clearance and operating at higher tip speeds.", "USERDEFINED": "User-defined fan type.", "VANEAXIAL": "Air flows through the impeller axially with guide vanes and reduced running blade tip clearance."}}, "IfcFastenerType / IfcFastener": {"description": "Representations of fixing parts which are used as fasteners to connect or join elements with other elements. Excluded are mechanical fasteners which are modeled by a separate entity (IfcMechanicalFastener).", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFastener.htm", "predefined_types": {"GLUE": "A fastening connection where glue is used to join together elements.", "MORTAR": "A composition of mineralic or other materials used to fill jointing gaps and possibly fulfilling a load carrying role.", "NOTDEFINED": "Undefined fastener.", "USERDEFINED": "User-defined fastener.", "WELD": "A weld seam between parts of metallic material or other suitable materials."}}, "IfcFilterType / IfcFilter": {"description": "A filter is an apparatus used to remove particulate or gaseous matter from fluids and gases.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFilter.htm", "predefined_types": {"AIRPARTICLEFILTER": "A filter used to remove particulates from air.", "COMPRESSEDAIRFILTER": "A filter used to remove particulates from compressed air.", "NOTDEFINED": "Undefined filter type.", "ODORFILTER": "A filter used to remove odors from air.", "OILFILTER": "A filter used to remove particulates from oil.", "STRAINER": "A filter used to remove particulates from a fluid.", "USERDEFINED": "User-defined filter type.", "WATERFILTER": "A filter used to remove particulates from water."}}, "IfcFireSuppressionTerminalType / IfcFireSuppressionTerminal": {"description": "A fire suppression terminal has the purpose of delivering a fluid (gas or liquid) that will suppress a fire.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFireSuppressionTerminal.htm", "predefined_types": {"BREECHINGINLET": "Symmetrical pipe fitting that unites two or more inlets into a single pipe. A breeching inlet may be used on either a wet or dry riser. Used by fire services personnel for fast connection of fire appliance hose reels. May also be used for foam.", "FIREHYDRANT": "Device, fitted to a pipe, through which a temporary supply of water may be provided.  May also be termed a stand pipe.", "FIREMONITOR": "Fire monitor.", "HOSEREEL": "A supporting framework on which a hose may be wound.", "NOTDEFINED": "Undefined type.", "SPRINKLER": "Device for sprinkling water from a pipe under pressure over an area.", "SPRINKLERDEFLECTOR": "Device attached to a sprinkler to deflect the water flow into a spread pattern to cover the required area.", "USERDEFINED": "User-defined type"}}, "IfcFlowInstrumentType / IfcFlowInstrument": {"description": "A flow instrument reads and displays the value of a particular property of a system at a point, or displays the difference in the value of a property between two points.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFlowInstrument.htm", "predefined_types": {"AMMETER": "A device that reads and displays the current flow in a circuit.", "COMBINED": "A device that reads and displays the value of multiple properties of a system at a point, or displays the difference in the value of a property between two points.", "FREQUENCYMETER": "A device that reads and displays the electrical frequency of an alternating current circuit.", "NOTDEFINED": "Undefined type.", "PHASEANGLEMETER": "A device that reads and displays the phase angle of a phase in a polyphase electrical circuit.", "POWERFACTORMETER": "A device that reads and displays the power factor of an electrical circuit.", "PRESSUREGAUGE": "A device that reads and displays a pressure value at a point or the pressure difference between two points.", "THERMOMETER": "A device that reads and displays a temperature value at a point.", "USERDEFINED": "User-defined type.", "VOLTMETER": "A device that measures and displays the voltage in a circuit.", "VOLTMETER_PEAK": "A device that reads and displays the peak voltage in an electrical circuit.", "VOLTMETER_RMS": "A device that reads and displays the RMS (mean) voltage in an electrical circuit."}}, "IfcFlowMeterType / IfcFlowMeter": {"description": "A flow meter is a device that is used to measure the flow rate in a system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFlowMeter.htm", "predefined_types": {"ENERGYMETER": "An electric meter or energy meter is a device that measures the amount of electrical energy supplied to or produced by a residence, business or machine.", "GASMETER": "A device that measures the quantity of a gas or fuel.", "NOTDEFINED": "Undefined meter type", "OILMETER": "A device that measures the quantity of oil.", "USERDEFINED": "User-defined meter type", "WATERMETER": "A device that measures the quantity of water."}}, "IfcFootingType / IfcFooting": {"description": "A footing is a part of the foundation of a structure that spreads and transmits the load to the soil. A footing is also characterized as shallow foundation, where the loads are transferred to the ground near the surface.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFooting.htm", "predefined_types": {"CAISSON_FOUNDATION": "A foundation construction type used in underwater construction.", "FOOTING_BEAM": "Footing elements that are in bending and are supported clear of the ground. They will normally span between piers, piles or pile caps. They are distinguished from beams in the building superstructure since they will normally require a lower grade of finish. They are distinguished from STRIP_FOOTING since they are clear of the ground surface and hence require support to the lower face while the concrete is curing.", "NOTDEFINED": "The type of footing is not defined.", "PAD_FOOTING": "An element that transfers the load of a single column (possibly two) to the ground.", "PILE_CAP": "An element that transfers the load from a column or group of columns to a pier or pile or group of piers or piles.", "STRIP_FOOTING": "A linear element that transfers loads into the ground from either a continuous element, such as a wall, or from a series of elements, such as columns.", "USERDEFINED": "Special types of footings which meet specific local requirements."}}, "IfcFurnishingElementType / IfcFurnishingElement": {"description": "A furnishing element is a generalization of all furniture related objects. Furnishing objects are characterized as being", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFurnishingElement.htm", "predefined_types": {}}, "IfcFurnitureType / IfcFurniture": {"description": "Furniture defines complete furnishings such as a table, desk, chair, or cabinet, which may or may not be permanently attached to a building structure.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcFurniture.htm", "predefined_types": {"BED": "Furniture for sleeping.", "CHAIR": "Furniture for seating a single person.", "DESK": "Furniture with a countertop and optional drawers for a single person.", "FILECABINET": "Furniture with sliding drawers for storing files.", "NOTDEFINED": "Undefined type.", "SHELF": "Furniture for storing books or other items.", "SOFA": "Furniture for seating multiple people.", "TABLE": "Furniture with a countertop for multiple people.", "TECHNICALCABINET": "A technical cabinet is a piece of furniture for holding, displaying and protecting technical appliances, usually organized in shelves, drawers or racks.", "USERDEFINED": "User-defined type."}}, "IfcGeographicElementType / IfcGeographicElement": {"description": "An IfcGeographicElement is a generalization of all elements within a geographical landscape. It includes occurrences of typical geographical elements, often referred to as features, such as trees or terrain. Common type information behind several occurrences of IfcGeographicElement is provided by the IfcGeographicElementType.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcGeographicElement.htm", "predefined_types": {"NOTDEFINED": "Not defined", "SOIL_BORING_POINT": "Soil boring point", "TERRAIN": "Terrain", "USERDEFINED": "User defined", "VEGETATION": "Plant life or plant cover (as of an area). For example trees, shrubs, herbs, grasses, ferns, and mosses."}}, "IfcGeomodel": {"description": "Representation of the concept of a volumetric geological and geotechnical model, usually an interpretation but sometimes created direct from ground penetrating measurement.\nThe assembly may contain one of more strata and other anthropic elements. The contained subtypes of IfcGeotechnicalStratum will have shape representations made from polyhedra or surfaces if a 'Yabuki' top surface model is being used.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcGeomodel.htm", "predefined_types": {}}, "IfcGeoslice": {"description": "Representation of the concept of a sectional planar geological and geotechnical model, usually an interpretation but sometimes created direct from ground penetrating measurement. The assembly may contain one of more strata and anthropic elements. The contained subtypes of IfcGeotechnicalStratum will have shape representations made from polygons reflecting the visible section or poly lines if a 'Yabuki' top surface model is being used.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcGeoslice.htm", "predefined_types": {}}, "IfcGeotechnicalStratum": {"description": "Representation of the concept of an identified discrete almost homogeneous geological feature with either an irregular solid or 'Yabuki' top surface shape or a regular voxel cubic shape. A stratum is represented as a discrete entity, specialised (sub typed) from IfcElement. A stratum may be broken down into smaller entities if properties vary across the stratum or alternatively properties may be described with bounded numeric ranges. A stratum may carry information about the physical form and its interpretation as a Geological Item (GML).\nThe shape representations used should correspond to the sub-type of IfcGeotechnicalAssembly in which it occurs\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcGeotechnicalStratum.htm", "predefined_types": {"NOTDEFINED": "", "SOLID": "Representation of the concept of an identified discrete almost homogenous solid geological or surface feature, including discontinuities such as faults, fractures, boundaries and interfaces that are not explicitly modelled.", "USERDEFINED": "", "VOID": "Representation of the concept of an identified discrete air filled geological feature, including caves and other voids.", "WATER": "Representation of the concept of an identified discrete water filled geological or surface feature including lakes, rivers and seas."}}, "IfcHeatExchangerType / IfcHeatExchanger": {"description": "A heat exchanger is a device used to provide heat transfer between non-mixing media such as plate and shell and tube heat exchangers.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcHeatExchanger.htm", "predefined_types": {"NOTDEFINED": "Undefined heat exchanger type.", "PLATE": "Plate heat exchanger.", "SHELLANDTUBE": "Shell and Tube heat exchanger.", "TURNOUTHEATING": "A device used to remove snow from railways. E.g. electric heating device, gas heater", "USERDEFINED": "User-defined heat exchanger type."}}, "IfcHumidifierType / IfcHumidifier": {"description": "A humidifier is a device that adds moisture into the air.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcHumidifier.htm", "predefined_types": {"ADIABATICAIRWASHER": "Water vapor is added into the airstream through adiabatic evaporation using an air washing element.", "ADIABATICATOMIZING": "Water vapor is added into the airstream through adiabatic evaporation using an atomizing element.", "ADIABATICCOMPRESSEDAIRNOZZLE": "Water vapor is added into the airstream through adiabatic evaporation using a compressed air nozzle.", "ADIABATICPAN": "Water vapor is added into the airstream through adiabatic evaporation using a pan.", "ADIABATICRIGIDMEDIA": "Water vapor is added into the airstream through adiabatic evaporation using a rigid media.", "ADIABATICULTRASONIC": "Water vapor is added into the airstream through adiabatic evaporation using an ultrasonic element.", "ADIABATICWETTEDELEMENT": "Water vapor is added into the airstream through adiabatic evaporation using a wetted element.", "ASSISTEDBUTANE": "Water vapor is added into the airstream through water heated evaporation using a butane heater.", "ASSISTEDELECTRIC": "Water vapor is added into the airstream through water heated evaporation using an electric heater.", "ASSISTEDNATURALGAS": "Water vapor is added into the airstream through water heated evaporation using a natural gas heater.", "ASSISTEDPROPANE": "Water vapor is added into the airstream through water heated evaporation using a propane heater.", "ASSISTEDSTEAM": "Water vapor is added into the airstream through water heated evaporation using a steam heater.", "NOTDEFINED": "Undefined humidifier type.", "STEAMINJECTION": "Water vapor is added into the airstream through direct steam injection.", "USERDEFINED": "User-defined humidifier type."}}, "IfcImpactProtectionDeviceType / IfcImpactProtectionDevice": {"description": "A impact protection device is a component used to protect other built elements from kinetic damage. impact protection devices currently come in different varieties:\n- A vibration damper used to minimize the effects of vibration in a structure by dissipating kinetic energy. The damper may be passive (elastic, frictional, inertia) or active (in a system using sensors and actuators).\n- A vibration isolator is a device used to minimize the effects of vibration transmissibility in a structure.\n- Impact devices that dissipate kinetic energy from impacting elements (such as vehicles) by deformation or elastic mechanics.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcImpactProtectionDevice.htm", "predefined_types": {"BUMPER": "A bumper is a buffer object at end of track that prevents driving over. It can be fixed on rails or the track panel, or can also be a natural element (e.g. rock, sand).", "CRASHCUSHION": "NOTE Definition from EN1317-1:2010: road vehicle energy absorption device installed in front of one or more hazards to reduce the severity of impact", "DAMPINGSYSTEM": "An elastic element inserted between the superstructure (track and plate on slab track or ballast bed with ballast inserted in) and the tunnel structure (tunnel floor). Some of the elastic elements have a partial decoupling effect between the superstructure and underground due to vibrations. Both helical springs and elastomer blocks or elastomer strips can be used as suspension systems.", "FENDER": "A passive or active device formed of a damper and impact panel that is mounted on the quayside to protect against vessel impact.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type"}}, "IfcInterceptorType / IfcInterceptor": {"description": "An interceptor is a device designed and installed in order to separate and retain deleterious, hazardous or undesirable matter while permitting normal sewage or liquids to discharge into a collection system by gravity.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcInterceptor.htm", "predefined_types": {"CYCLONIC": "Removes larger liquid drops or larger solid particles.", "GREASE": "Chamber, on the line of a drain or discharge pipe, that prevents grease passing into a drainage system.", "NOTDEFINED": "Undefined type.", "OIL": "One or more chambers arranged to prevent the ingress of oil to a drain or sewer that retains the oil for later removal.", "PETROL": "Two or more chambers with inlet and outlet pipes arranged to allow petrol/gasoline collected on the surface of water drained into them to evaporate through ventilating pipes.", "USERDEFINED": "User-defined type."}}, "IfcJunctionBoxType / IfcJunctionBox": {"description": "A junction box is an enclosure within which cables are connected.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcJunctionBox.htm", "predefined_types": {"DATA": "Contains cables, outlets, and/or switches for communications use.", "NOTDEFINED": "Undefined type.", "POWER": "Contains cables, outlets, and/or switches for electrical power.", "USERDEFINED": "User-defined type."}}, "IfcKerbType / IfcKerb": {"description": "A border of stone, concrete or other rigid material formed at the edge of the carriageway or footway.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcKerb.htm", "predefined_types": {"NOTDEFINED": "", "USERDEFINED": ""}}, "IfcLampType / IfcLamp": {"description": "A lamp is an artificial light source such as a light bulb or tube.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcLamp.htm", "predefined_types": {"COMPACTFLUORESCENT": "A fluorescent lamp having a compact form factor produced by shaping the tube.", "FLUORESCENT": "A typically tubular discharge lamp in which most of the light is emitted by one or several layers of phosphors excited by ultraviolet radiation from the discharge.", "HALOGEN": "An incandescent lamp in which a tungsten filament is sealed into a compact transport envelope filled with an inert gas and a small amount of halogen such as iodine or bromine.", "HIGHPRESSUREMERCURY": "A discharge lamp in which most of the light is emitted by exciting mercury at high pressure.", "HIGHPRESSURESODIUM": "A discharge lamp in which most of the light is emitted by exciting sodium at high pressure.", "LED": "A solid state lamp that uses light-emitting diodes as the source of light.", "METALHALIDE": "A discharge lamp in which most of the light is emitted by exciting a metal halide.", "NOTDEFINED": "Undefined type.", "OLED": "A solid state lamp that uses light-emitting diodes as the source of light whose emissive electroluminescent layer is composed of a film of organic compounds.", "TUNGSTENFILAMENT": "A lamp that emits light by passing an electrical current through a tungsten wire filament in a near vacuum.", "USERDEFINED": "User-defined type."}}, "IfcLightFixtureType / IfcLightFixture": {"description": "A light fixture is a container that is designed for the purpose of housing one or more lamps and optionally devices that control, restrict or vary their emission.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcLightFixture.htm", "predefined_types": {"DIRECTIONSOURCE": "A light fixture that is considered to have a length or surface area from which it emits light in a direction. A light fixture containing one or more fluorescent lamps is an example of a direction source.", "NOTDEFINED": "Undefined type.", "POINTSOURCE": "A light fixture that is considered to have negligible area and that emit light with approximately equal intensity in all directions.  A light fixture containing a tungsten, halogen or similar bulb is an example of a point source.", "SECURITYLIGHTING": "A light fixture having specific purpose of directing occupants in an emergency, such as an illuminated exit sign or emergency flood light.", "USERDEFINED": "User-defined type."}}, "IfcLiquidTerminalType / IfcLiquidTerminal": {"description": "A liquid terminal is a terminating or origination point for the transfer of liquid between distribution system(s). this is the point where the liquid distribution system interacts with the external environment. An example of this is a loading arm for the transfer of liquid from a docked vessel.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcLiquidTerminal.htm", "predefined_types": {"HOSEREEL": "A Supporting framework on which a hose may be wound whose primary purpose is to connect and interact with the external environment.", "LOADINGARM": "A loading arm permits the transfer of liquid or liquefied gas from one system to another, through the use of an articulated arm that accounts for the movement of docked vessels.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type"}}, "IfcMechanicalFastenerType / IfcMechanicalFastener": {"description": "A mechanical fasteners connecting building elements or parts mechanically. A single instance of this class may represent one or many of actual mechanical fasteners, for example an array of bolts or a row of nails.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMechanicalFastener.htm", "predefined_types": {"ANCHORBOLT": "A special bolt which is anchored into concrete, stone, or brickwork.", "BOLT": "A threaded cylindrical rod that engages with a similarly threaded hole in a nut or any other part to form a fastener. The mechanical fastener often also includes one or more washers and one or more nuts.", "CHAIN": "a series of linked metal rings used for fastening or securing something, or for pulling loads.", "COUPLER": "A part connecting two rod or bars, such as reinforcement bars.", "DOWEL": "A cylindrical rod that is driven into holes of the connected pieces.", "NAIL": "A thin pointed piece of metal that is hammered into materials as a fastener.", "NAILPLATE": "A piece of sheet metal with punched points that overlaps the connected pieces and is pressed into their material.", "NOTDEFINED": "Undefined mechanical fastener.", "RAILFASTENING": "An assembly of components which secures a rail to the supporting structure and retains it in the required position whilst permitting any necessary vertical, lateral and longitudinal movement. Note: definition from EN 13481-1.", "RAILJOINT": "A mechanical assembly with e.g. fishplates to join two rail ends with optional functions (insulation or expansion capacity).", "RIVET": "A fastening part having a head at one end and the other end being hammered flat after being passed through holes in the pieces that are fastened together.", "ROPE": "a length of thick strong cord made by twisting together strands of hemp, sisal, nylon, or similar material. used primarily for mooring vessels", "SCREW": "A fastener with a tapered threaded shank and a slotted head.", "SHEARCONNECTOR": "A ring connector that is accepted by ring keyways in the connected pieces; or a toothed circular or square connector that is pressed into the connected pieces.", "STAPLE": "A doubly pointed piece of metal that is hammered into materials as a fastener.", "STUDSHEARCONNECTOR": "Stud shear connectors are cylindrical fastening parts with a head on one side. On the other side they are welded on steel members for the use in composite steel and concrete structures.", "USERDEFINED": "User-defined mechanical fastener."}}, "IfcMedicalDeviceType / IfcMedicalDevice": {"description": "A medical device is attached to a medical piping system and operates upon medical gases to perform a specific function. Medical gases include medical air, medical vacuum, oxygen, carbon dioxide, nitrogen, and nitrous oxide.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMedicalDevice.htm", "predefined_types": {"AIRSTATION": "Device that provides purified medical air, composed of an air compressor and air treatment line.", "FEEDAIRUNIT": "Device that feeds air to an oxygen generator, composed of an air compressor, air treatment line, and an air receiver.", "NOTDEFINED": "Undefined medical device type.", "OXYGENGENERATOR": "Device that generates oxygen from air.", "OXYGENPLANT": "Device that combines a feed air unit, oxygen generator, and backup oxygen cylinders.", "USERDEFINED": "User-defined medical device type.", "VACUUMSTATION": "Device that provides suction, composed of a vacuum pump and bacterial filtration line."}}, "IfcMemberType / IfcMember": {"description": "An IfcMember is a structural member designed to carry loads between or beyond points of support. It is not required to be load bearing. The orientation of the member (being horizontal, vertical or sloped) is not relevant to its definition (in contrary to IfcBeam and IfcColumn). An IfcMember represents a linear structural element from an architectural or structural modeling point of view and shall be used if it cannot be expressed more specifically as either an IfcBeam or an IfcColumn.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMember.htm", "predefined_types": {"ARCH_SEGMENT": "Individual segment of an arch structure.", "BRACE": "A linear element (usually sloped) often used for bracing of a girder or truss.", "CHORD": "Upper or lower longitudinal member of a truss, used horizontally or sloped.", "COLLAR": "A linear element (usually used horizontally) within a roof structure to connect rafters and posts.", "MEMBER": "A linear element within a girder or truss with no further meaning.", "MULLION": "A linear element within a curtain wall system to connect two (or more) panels.", "NOTDEFINED": "Undefined linear element.", "PLATE": "A linear continuous horizontal element in wall framing, such as a head piece or a sole plate.", "POST": "A linear (usually vertical) member used to support something or to mark a point.", "PURLIN": "A linear element (usually used horizontally) within a roof structure to support rafters.", "RAFTER": "A linear elements used to support roof slabs or roof covering, usually used with slope.", "STAY_CABLE": "A sloped element suspending a structure (such as bridge deck) from a pylon.", "STIFFENING_RIB": "A linear element added to a flange or a web plate of a girder for local stiffening.", "STRINGER": "A linear element used to support stair or ramp flights, usually used with slope.", "STRUCTURALCABLE": "A linear cable element used to secure or stabilise a structure by resisting lateral and longitudinal loading  through tension only, but cannot resist compression. usually formed of a flexible cable or wire.", "STRUT": "A linear element often used within a girder or truss.", "STUD": "Vertical element in wall framing.", "SUSPENDER": "A vertical element suspending a structure (such as bridge deck) from a suspension cable or an arch.", "SUSPENSION_CABLE": "A suspended element, typically comprising steel wire, sheath, etc.", "TIEBAR": "A linear bar element used to secure or stabilise a structure by resisting lateral and longitudinal loading through tension and or compression. usually formed by a solid bar.", "USERDEFINED": "User-defined linear element."}}, "IfcMobileTelecommunicationsApplianceType / IfcMobileTelecommunicationsAppliance": {"description": "A mobile telecommunications appliance is a device that transmits, converts, amplifies or receives signals used in mobile networks.\nNote: This entity is used to define specific appliances used in mobile telecommunication networks. General communications appliances and those used in fixed transmission networks should be instantiated using IfcCommunicationsAppliance.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMobileTelecommunicationsAppliance.htm", "predefined_types": {"ACCESSPOINT": "An access point is a device that allows wireless devices to connect to a wired network.", "BASEBANDUNIT": "A baseband unit is a component of a distributed base transceiver station for implementing baseband processing functions.", "BASETRANSCEIVERSTATION": "A base transceiver station (BTS) is a network component which serves one cell. It completes the conversion between base station controller and wireless channel, and realizes the wireless transmission and related control functions between base station controller and mobile switching through the air interface.", "E_UTRAN_NODE_B": "An E-utran nodel B is a logical network component which serves one or more E-utran cells. It is the hardware connected to the evolved packet core (EPC), more specifically to the mobility management entity (MME) , which communicates directly with user equipment in wireless way.", "GATEWAY_GPRS_SUPPORT_NODE": "The gateway GPRS support node is a component of the GPRS core network that extends the GSM to allow packet switching functionalities. This component is responsible for the internetworking between the GPRS network and external packet switched networks (e.g. the internet).", "MASTERUNIT": "A master unit is a component of a repeater for coupling base station signals.", "MOBILESWITCHINGCENTER": "The mobile switching centre (MSC) constitutes the interface between the radio system and the fixed networks. It is an exchange which performs all the switching and signalling functions for mobile station located in a geographical area designated as the MSC area. It consists of a MSC server and a media gateway.", "MSCSERVER": "The MSC server mainly comprises the call control (CC) and mobility control parts of a mobile switching center (MSC). An MSC server and a media gateway make up the full functionality of an MSC.", "NOTDEFINED": "Undefined type.", "PACKETCONTROLUNIT": "A packet control unit performs some of the processing tasks of the base station controller for packet data. It is responsible for data packet, wireless channel management, error sending detection and automatic retransmission.", "REMOTERADIOUNIT": "A remote radio unit is a component of a distributed base transceiver station that converts digital baseband signals into high-frequency (rf) signals and sends high-frequency (rf) signals to the antenna for radiation.", "REMOTEUNIT": "A remote unit is a device used to amplify a base station signal.", "SERVICE_GPRS_SUPPORT_NODE": "The service GPRS support node (SGSN) is a component of the GPRS core network. It is the GPRS support node of mobile station service, and it can achieve mobility management and packet routing and transfer.", "SUBSCRIBERSERVER": "It is a database in charge of the management of mobile subscribers. It can be an authentication center (AuC)  or a home location register (HLR).", "USERDEFINED": "User-defined type"}}, "IfcMooringDeviceType / IfcMooringDevice": {"description": "A mooring device is an active or passive built element who's primary function is to participate in the mooring of a vessel, this could be in the form of a bollard used as an attachment point for lines or active equipment such as quick release hooks.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMooringDevice.htm", "predefined_types": {"BOLLARD": "a short, thick post on the deck of a ship or a quay side, to which ship's rope may be secured. not to be confused with traffic bollards.", "LINETENSIONER": "A mechanical device used to apply a tensioning load to mooring lines to improve vessel stability for port operations.", "MAGNETICDEVICE": "Mooring device that uses magnets as the primary method of securing the vessel.", "MOORINGHOOKS": "Quick release mooring hooks - an active device used to secure a vessel and provide automated release of vessels.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type", "VACUUMDEVICE": "Mooring device that uses vacuum suction as the primary method of securing the vessel."}}, "IfcMotorConnectionType / IfcMotorConnection": {"description": "A motor connection provides the means for connecting a motor as the driving device to the driven device.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcMotorConnection.htm", "predefined_types": {"BELTDRIVE": "An indirect connection made through the medium of a shaped, flexible continuous loop.", "COUPLING": "An indirect connection made through the medium of the viscosity of a fluid.", "DIRECTDRIVE": "A direct, physical connection made between the motor and the driven device.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type."}}, "IfcNavigationElementType / IfcNavigationElement": {"description": "A navigation element is an active or passive built element who's primary function is to provide navigational instructions and warnings to vessels, this could be in the form of a floating buoy, a fixed beacon.\nNavigation elements can aggregate other components and elements to form the entire structure. this might include a frame structure to form the body, instances of IfcSign for signage or instances of IfcSignal for supplementary lights an/or sound signals.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcNavigationElement.htm", "predefined_types": {"BEACON": "a fixed vertical structure serving as a navigation mark, to show reefs or other hazards, or provide navigational directions.", "BUOY": "an anchored floating structure serving as a navigation mark, to show reefs or other hazards, or provide navigational directions.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type"}}, "IfcOpeningElement": {"description": "The opening element stands for opening, recess or chase, all reflecting voids. It represents a void within any element that has physical manifestation. Openings can be inserted into walls, slabs, beams, columns, or other elements.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcOpeningElement.htm", "predefined_types": {"NOTDEFINED": "Undefined opening element.", "OPENING": "An opening as subtraction feature that cuts through the element it voids. It thereby creates a hole. An opening in addiion have a particular meaning for either providing a void for doors or windows, or an opening to permit flow of air and passing of light.", "RECESS": "An opening as subtraction feature that does not cut through the element it voids. It creates a niche or similar voiding pattern.", "USERDEFINED": "User-defined opening element."}}, "IfcOutletType / IfcOutlet": {"description": "An outlet is a device installed at a point to receive one or more inserted plugs for electrical power or communications.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcOutlet.htm", "predefined_types": {"AUDIOVISUALOUTLET": "An outlet used for an audio or visual device.", "COMMUNICATIONSOUTLET": "An outlet used for connecting communications equipment.", "DATAOUTLET": "An outlet used for connecting data communications equipment.", "NOTDEFINED": "Undefined type.<", "POWEROUTLET": "An outlet used for connecting electrical devices requiring power.", "TELEPHONEOUTLET": "An outlet used for connecting telephone communications equipment.", "USERDEFINED": "User-defined type."}}, "IfcPavementType / IfcPavement": {"description": "Type of built element in a road or other paved area to provide an even surface sustaining loads from vehicles or pedestrians, usually comprising several courses.\nNOTE Definition from ISO 6707-1: road, runway, or similar construction above the subgrade.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPavement.htm", "predefined_types": {"FLEXIBLE": "Flexible pavements, including less rigid pavements like rubber.", "NOTDEFINED": "Undefined type.", "RIGID": "Pavement substantially constructed of cement concrete.", "USERDEFINED": "User-defined type."}}, "IfcPileType / IfcPile": {"description": "A pile is a slender timber, concrete, or steel structural element, driven, jetted, or otherwise embedded on end in the ground for the purpose of supporting a load. A pile is also characterized as deep foundation, where the loads are transferred to deeper subsurface layers.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPile.htm", "predefined_types": {"BORED": "A bore pile.", "COHESION": "A cohesion pile.", "DRIVEN": "A rammed, vibrated, or otherwise driven pile.", "FRICTION": "A friction pile.", "JETGROUTING": "An injected pile-like construction.", "NOTDEFINED": "The type of pile function is not defined.", "SUPPORT": "A support pile.", "USERDEFINED": "The type of pile function is user defined."}}, "IfcPipeFittingType / IfcPipeFitting": {"description": "A pipe fitting is a junction or transition in a piping flow distribution system used to connect pipe segments, resulting in changes in flow characteristics to the fluid such as direction or flow rate.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPipeFitting.htm", "predefined_types": {"BEND": "A fitting with typically two ports used to change the direction of flow between connected elements.", "CONNECTOR": "Connector fitting, typically used to join two ports together within a flow distribution system (e.g., a coupling used to join two pipe segments).", "ENTRY": "Entry fitting, typically unconnected at one port and connected to a flow distribution system at the other (e.g., a breeching inlet).", "EXIT": "Exit fitting, typically unconnected at one port and connected to a flow distribution system at the other (e.g., a hose bibb).", "JUNCTION": "A fitting with typically more than two ports used to redistribute flow among the ports and/or to change the direction of flow between connected elements (e.g, tee, cross, wye, etc.).", "NOTDEFINED": "Undefined fitting.", "OBSTRUCTION": "A fitting with typically two ports used to obstruct or restrict flow between the connected elements (e.g., screen, perforated plate, etc.).", "TRANSITION": "A fitting with typically two ports having different shapes or sizes. Can also be used to change the direction of flow between connected elements.", "USERDEFINED": "User-defined fitting."}}, "IfcPipeSegmentType / IfcPipeSegment": {"description": "A pipe segment is used to typically join two sections of a piping network.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPipeSegment.htm", "predefined_types": {"CULVERT": "A covered channel or large pipe that forms a watercourse below ground level, usually under a road or railway.", "FLEXIBLESEGMENT": "A flexible segment is a continuous non-linear segment of pipe that can be deformed and change the direction of flow.", "GUTTER": "A gutter segment is a continuous open-channel segment of pipe.", "NOTDEFINED": "Undefined segment.", "RIGIDSEGMENT": "A rigid segment is continuous linear segment of pipe that cannot be deformed.", "SPOOL": "A type of rigid segment that is typically shorter and used for providing connectivity within a piping network.", "USERDEFINED": "User-defined segment."}}, "IfcPlateType / IfcPlate": {"description": "An IfcPlate is a planar and often flat part with constant thickness. A plate may carry loads between or beyond points of support, or provide stiffening. The location of the plate (being horizontal, vertical or sloped) is not relevant to its definition.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPlate.htm", "predefined_types": {"BASE_PLATE": "A plate used to spread load over a surface, such as underneath a bearing or column.", "COVER_PLATE": "A plate (underneath or above) a flange to provide additional load capacity.", "CURTAIN_PANEL": "A planar element within a curtain wall, often consisting of a frame with fixed glazing.", "FLANGE_PLATE": "A flange plate in linear members having box or I-profile (e.g. top or bottom flange plate in box-girder).", "GUSSET_PLATE": "a plate or bracket for strengthening an angle in framework (as in a building or bridge).", "NOTDEFINED": "Undefined linear element.", "SHEET": "A planar, flat and thin element, comes usually as metal sheet, and is often used as an additional part within an assembly.", "SPLICE_PLATE": "A plate connecting two members joined at ends.", "STIFFENER_PLATE": "A transversal plate added to a flange or a web plate for local stiffening.", "USERDEFINED": "User-defined linear element.", "WEB_PLATE": "A plate connecting flange plates in linear members having box or I-profile."}}, "IfcProjectionElement": {"description": "The projection element is a specialization of the general feature element to represent projections applied to building elements. It represents a solid attached to any element that has physical manifestation.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcProjectionElement.htm", "predefined_types": {"BLISTER": "Part of concrete where the anchor for pre-stressing tendon can be embedded.", "DEVIATOR": "Part of concrete where re-direction of an external pre-stressed tendon can be embedded.", "NOTDEFINED": "Undefined projection element.", "USERDEFINED": "User-defined projection element."}}, "IfcProtectiveDeviceTrippingUnitType / IfcProtectiveDeviceTrippingUnit": {"description": "A protective device tripping unit breaks an electrical circuit at a separate breaking unit when a stated electric current that passes through the unit is exceeded.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcProtectiveDeviceTrippingUnit.htm", "predefined_types": {"ELECTROMAGNETIC": "A tripping unit activated by electromagnetic action.", "ELECTRONIC": "A tripping unit activated by electronic action.", "NOTDEFINED": "Undefined type.", "RESIDUALCURRENT": "A tripping unit activated by residual current detection.", "THERMAL": "A tripping unit activated by thermal action.", "USERDEFINED": "User-defined type."}}, "IfcProtectiveDeviceType / IfcProtectiveDevice": {"description": "A protective device breaks an electrical circuit when a stated electric current that passes through it is exceeded.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcProtectiveDevice.htm", "predefined_types": {"ANTI_ARCING_DEVICE": "An anti-arcing device is an equipment that prevents electric arc.", "CIRCUITBREAKER": "A mechanical switching device capable of making, carrying, and breaking currents under normal circuit conditions and also making, carrying for a specified time and breaking, current under specified abnormal circuit conditions such as those of short circuit.", "EARTHINGSWITCH": "A safety device used to open or close a circuit when there is no current. Used to isolate a part of a circuit, a machine, a part of an overhead line or an underground line so that maintenance can be safely conducted.", "EARTHLEAKAGECIRCUITBREAKER": "A device that opens, closes, or isolates a circuit and has short circuit protection but no overload protection.  It attempts to break the circuit when there is a leakage of current from phase to earth, by measuring voltage on the earth conductor.", "FUSEDISCONNECTOR": "A device that will electrically open the circuit after a period of prolonged, abnormal current flow.", "NOTDEFINED": "Undefined type.", "RESIDUALCURRENTCIRCUITBREAKER": "A device that opens, closes, or isolates a circuit and has short circuit and overload protection.  It attempts to break the circuit when there is a difference in current between any two phases.  May also be referred to as 'Ground Fault Interupter (GFI)' or 'Ground Fault Circuit Interuptor (GFCI)'", "RESIDUALCURRENTSWITCH": "A device that opens, closes or isolates a circuit and has no short circuit or overload protection.  May also be identified as a 'ground fault switch'.", "SPARKGAP": "A spark gap is a device used to connect a circuit to earth in the event of a fault in live circuits.", "USERDEFINED": "User-defined type.", "VARISTOR": "A high voltage surge protection device.", "VOLTAGELIMITER": "a voltage limiter is an equipment that prevents the over voltage."}}, "IfcPumpType / IfcPump": {"description": "A pump is a device which imparts mechanical work on fluids or slurries to move them through a channel or pipeline. A typical use of a pump is to circulate chilled water or heating hot water in a building services distribution system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcPump.htm", "predefined_types": {"CIRCULATOR": "A Circulator pump is a generic low-pressure, low-capacity pump. It may have a wet rotor and may be driven by a flexible-coupled motor.", "ENDSUCTION": "An End Suction pump, when mounted horizontally, has a single horizontal inlet on the impeller suction side and a vertical discharge. It may have a direct or close-coupled motor.", "NOTDEFINED": "Pump type has not been defined.", "SPLITCASE": "A Split Case pump, when mounted horizontally, has an inlet and outlet on each side of the impeller. The impeller can be easily accessed by removing the front of the impeller casing. It may have a direct or close-coupled motor.", "SUBMERSIBLEPUMP": "A pump designed to be immersed in a fluid, typically a collection tank.", "SUMPPUMP": "A pump designed to sit above a collection tank with a suction inlet extending into the tank.", "USERDEFINED": "User-defined pump type.", "VERTICALINLINE": "A Vertical Inline pump has the pump and motor close-coupled on the pump casing. The pump depends on the connected, horizontal piping for support, with the suction and discharge along the piping axis.", "VERTICALTURBINE": "A Vertical Turbine pump has a motor mounted vertically on the pump casing for either                 wet-pit sump mounting or dry-well mounting."}}, "IfcRailType / IfcRail": {"description": "A rail is a predominately linear built element that has a special section profile. Rail is distinctive from built elements with similar geometric shapes (e.g. beam, member) that its major function is to ensure guidance of moving for vehicles or other kinds of machineries.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcRail.htm", "predefined_types": {"BLADE": "A blade is a machined rail, often of special section, but fixed and/or joined at the heel end to a rail to provide continuity of wheel support. The two switch rails in a set are the two inside rails. A switch rail is described as right or left hand according to whether it is part of a right hand or left hand half-set of switches. Note: definition from EN 13232-1-2004.", "CHECKRAIL": "A check rail is a rail laid close to the gauge face of a running rail which takes part in lateral guidance of the wheel and prevents derailment in small radius curved track and switches and crossings. Note: definition from EN 13481-1.", "GUARDRAIL": "A guard rail is a rail that limits risk of train derailment, normally not loaded.", "NOTDEFINED": "Undefined type.", "RACKRAIL": "A rack rail is a building module for enhancing traction and break performance.", "RAIL": "A rail is a special section bar (usually of steel) ensuring the guidance of the wheel of a rolling stock or other heavy machineries. In railway, two rails are combined to form a track.", "STOCKRAIL": "A stock rail is a fixed machined rail, ensuring the continuity on the main or diverging track with the switch in the open position. The machined part of the stock rail supports its switch rail in the closed position, giving continuity of line through this switch rail. The two stock rails in a set of switches are the two outside rails. A stock rail is described as right or left hand according to whether it is part of a right hand or left hand half-set of switches. Note: definition from EN 13232-1-2004.", "USERDEFINED": "User-defined type"}}, "IfcRailingType / IfcRailing": {"description": "The railing is a frame assembly adjacent to human or vehicle circulation spaces and at some space boundaries where it is used in lieu of walls or to complement walls. Designed as an optional physical support, or to prevent injury or damage, either by falling or collision.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcRailing.htm", "predefined_types": {"BALUSTRADE": "Similar to the definitions of a guardrail except the location is at the edge of a floor, rather then a stair or ramp. Examples are balustrates at roof-tops or balconies, or along a bridge or on top of a retaining wall.", "FENCE": "NOTE Definition from ISO6707-1: non-load bearing vertical construction, usually lightweight, which bounds or subdivides an external area.", "GUARDRAIL": "A type of railing designed to guard human or vehicle occupants from falling off a stair, ramp or landing where there is a vertical drop at the edge of such floors/landings, or to provide restraint to an errant road vehicle, installed on the central reserve of or alongside a road.", "HANDRAIL": "A type of railing designed to serve as an optional structural support for loads applied by human occupants (at hand height). Generally located adjacent to ramps and stairs. Generally floor or wall mounted.", "NOTDEFINED": "Undefined railing element, no type information available.", "USERDEFINED": "User-defined railing element, a term to identify the user type is given by the attribute IfcRailing.ObjectType."}}, "IfcRampFlightType / IfcRampFlight": {"description": "A ramp comprises a single inclined segment, or several inclined segments that are connected by a horizontal segment, referred to as a landing. A ramp flight is the single inclined segment and part of the ramp construction. In case of single flight ramps, the ramp flight and the ramp are identical.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcRampFlight.htm", "predefined_types": {"NOTDEFINED": "Undefined ramp flight.", "SPIRAL": "A ramp flight with a circular or elliptic walking line.", "STRAIGHT": "A ramp flight with a straight walking line.", "USERDEFINED": "User-defined ramp flight."}}, "IfcRampType / IfcRamp": {"description": "A ramp is a vertical passageway which provides a human or vehicle circulation link between one floor level and another floor level at a different elevation. It may include a landing as an intermediate floor slab. A ramp normally does not include steps.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcRamp.htm", "predefined_types": {"HALF_TURN_RAMP": "A ramp making a 180° turn, consisting of two straight flights connected by a halfspace landing. The orientation of the turn is determined by the walking line.", "NOTDEFINED": "", "QUARTER_TURN_RAMP": "A ramp making a 90° turn, consisting of two straight flights connected by a quarterspace landing. The direction of the turn is determined by the walking line.", "SPIRAL_RAMP": "A ramp constructed around a circular or elliptical well without newels and landings.", "STRAIGHT_RUN_RAMP": "A ramp - which is a sloping floor, walk, or roadway - connecting two levels. The straight ramp consists of one straight flight without turns or winders.", "TWO_QUARTER_TURN_RAMP": "A ramp making a 180° turn, consisting of three straight flights connected by two quarterspace landings. The direction of the turn is determined by the walking line.", "TWO_STRAIGHT_RUN_RAMP": "A straight ramp consisting of two straight flights without turns but with one landing.", "USERDEFINED": "Free form ramp (user defined operation type)."}}, "IfcReinforcingBarType / IfcReinforcingBar": {"description": "A reinforcing bar is usually made of steel with manufactured deformations in the surface, and used in concrete and masonry construction to provide additional strength. A single instance of this class may represent one or many of actual rebars, for example a row of rebars.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcReinforcingBar.htm", "predefined_types": {"ANCHORING": "Anchoring reinforcement.", "EDGE": "Edge reinforcement.", "LIGATURE": "The reinforcing bar is a ligature (link, stirrup).", "MAIN": "The reinforcing bar is a main bar.", "NOTDEFINED": "The type of reinforcement is not defined.", "PUNCHING": "Punching reinforcement.", "RING": "Ring reinforcement.", "SHEAR": "The reinforcing bar is a shear bar.", "SPACEBAR": "A stirrup in pre-stressing system to position TendonConduit.", "STUD": "The reinforcing bar is a stud.", "USERDEFINED": "The type of reinforcement is user defined."}}, "IfcReinforcingMeshType / IfcReinforcingMesh": {"description": "A reinforcing mesh is a series of longitudinal and transverse wires or bars of various gauges, arranged at right angles to each other and welded at all points of intersection; usually used for concrete slab reinforcement. It is also known as welded wire fabric. In scope are plane meshes as well as bent meshes.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcReinforcingMesh.htm", "predefined_types": {"NOTDEFINED": "The type of mesh is not defined.", "USERDEFINED": "The type of mesh is user defined."}}, "IfcRoofType / IfcRoof": {"description": "A roof is the covering of the top part of a building, it protects the building against the effects of weather.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcRoof.htm", "predefined_types": {"BARREL_ROOF": "A roof or ceiling having a semicylindrical form.", "BUTTERFLY_ROOF": "A roof having two slopes, each descending inward from the eaves.", "DOME_ROOF": "A hemispherical hip roof.", "FLAT_ROOF": "A roof having no slope, or one with only a slight pitch so as to drain rainwater.", "FREEFORM": "Free form roof.", "GABLE_ROOF": "A roof sloping downward in two parts from a central ridge, so as to form a gable at each end.", "GAMBREL_ROOF": "A roof sloping downward in two parts from a central ridge, so as to form a gable at each end.", "HIPPED_GABLE_ROOF": "A roof having a hipped end truncating a gable.", "HIP_ROOF": "A roof having sloping ends and sides meeting at an inclined projecting angle.", "MANSARD_ROOF": "A roof having on each side a steeper lower part and a shallower upper part.", "NOTDEFINED": "No specification given.", "PAVILION_ROOF": "A pyramidal hip roof.", "RAINBOW_ROOF": "A gable roof in the form of a broad Gothic arch, with gently sloping convex surfaces.", "SHED_ROOF": "A roof having a single slope.", "USERDEFINED": "No specification given."}}, "IfcSanitaryTerminalType / IfcSanitaryTerminal": {"description": "A sanitary terminal is a fixed appliance or terminal usually supplied with water and used for drinking, cleaning or foul water disposal or that is an item of equipment directly used with such an appliance or terminal.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSanitaryTerminal.htm", "predefined_types": {"BATH": "Sanitary appliance for immersion of the human body or parts of it.", "BIDET": "Waste water appliance for washing the excretory organs while sitting astride the bowl.", "CISTERN": "A water storage unit attached to a sanitary terminal that is fitted with a device, operated automatically or by the user, that discharges water to cleanse a water closet (toilet) pan, urinal or slop hopper.", "NOTDEFINED": "Undefined type.", "SANITARYFOUNTAIN": "A sanitary terminal that provides a low pressure jet of water for a specific purpose.", "SHOWER": "Installation or waste water appliance that emits a spray of water to wash the human body.", "SINK": "Waste water appliance for receiving, retaining or disposing of domestic, culinary, laboratory or industrial process liquids.", "TOILETPAN": "Soil appliance for the disposal of excrement.", "URINAL": "Soil appliance that receives urine and directs it to a waste outlet.", "USERDEFINED": "User-defined type.", "WASHHANDBASIN": "Waste water appliance for washing the upper parts of the body.", "WCSEAT": "[Deprecated] Hinged seat that fits on the top of a water closet (WC) pan."}}, "IfcSensorType / IfcSensor": {"description": "A sensor is a device that measures a physical quantity and converts it into a signal which can be read by an observer or by an instrument.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSensor.htm", "predefined_types": {"CO2SENSOR": "A device that senses or detects carbon dioxide.", "CONDUCTANCESENSOR": "A device that senses or detects electrical conductance.", "CONTACTSENSOR": "A device that senses or detects contact, such as for detecting if a door is closed.", "COSENSOR": "A device that senses or detects carbon monoxide.", "EARTHQUAKESENSOR": "A device that senses or detects the seismic wave and measures the seismic intensity in case of earthquake.", "FIRESENSOR": "A device that senses or detects fire", "FLOWSENSOR": "A device that senses or detects flow in a fluid.", "FOREIGNOBJECTDETECTIONSENSOR": "A device that senses or detects foreign objects that shock or break the power network. It may alarm when such accidents happen.", "FROSTSENSOR": "A device that senses or detects frost on a window.", "GASSENSOR": "A device that senses or detects gas concentration (other than CO2)", "HEATSENSOR": "A device that senses or detects heat.", "HUMIDITYSENSOR": "A device that senses or detects humidity.", "IDENTIFIERSENSOR": "A device that reads a tag, such as for gaining access to a door or elevator", "IONCONCENTRATIONSENSOR": "A device that senses or detects ion concentration, such as for water hardness.", "LEVELSENSOR": "A device that senses or detects fill level, such as for a tank.", "LIGHTSENSOR": "A device that senses or detects light.", "MOISTURESENSOR": "A device that senses or detects moisture.", "MOVEMENTSENSOR": "A device that senses or detects movement.", "NOTDEFINED": "Undefined type.", "OBSTACLESENSOR": "A device that senses or detects any obstacles. Examples are: detectors sensing objects falling from a bridge, rock-fall detectors, etc.", "PHSENSOR": "A device that senses or detects acidity.", "PRESSURESENSOR": "A device that senses or detects pressure.", "RADIATIONSENSOR": "A device that senses or detects pressure.", "RADIOACTIVITYSENSOR": "A device that senses or detects atomic decay.", "RAINSENSOR": "A device that senses or collects rainfall related information.", "SMOKESENSOR": "A device that senses or detects smoke.", "SNOWDEPTHSENSOR": "A device that senses or measures the depth of snowfall.", "SOUNDSENSOR": "A device that senses or detects sound.", "TEMPERATURESENSOR": "A device that senses or detects temperature.", "TRAINSENSOR": "A device, usually attached to the rear end of the last vehicle of a train, acting on a fixed equipment to give an indication that the train is complete.", "TURNOUTCLOSURESENSOR": "A device that senses or detects the position of a blade of a turnout.", "USERDEFINED": "User-defined type.", "WHEELSENSOR": "A device that senses or detects the passage of a wheel.", "WINDSENSOR": "A device that senses or detects airflow speed and direction."}}, "IfcShadingDeviceType / IfcShadingDevice": {"description": "Shading devices are purpose built devices to protect from the sunlight, from natural light, or screening them from view. Shading devices can form part of the facade or can be mounted inside the building, they can be fixed or operable.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcShadingDevice.htm", "predefined_types": {"AWNING": "A rooflike shelter of canvas or other material extending over a doorway, from the top of a window, over a deck, or similar, in order to provide protection, as from the sun.", "JALOUSIE": "A blind with adjustable horizontal slats for admitting light and air while excluding direct sun and rain.", "NOTDEFINED": "", "SHUTTER": "A mechanical devices that limits the passage of light. Often used as a a solid or louvered movable cover for a window.", "USERDEFINED": ""}}, "IfcSignType / IfcSign": {"description": "A sign is a notice on display that gives information or instructions in a written, symbolic or other form. Signs are passive with the most common form of a pictorial panel. An instance of IfcSign refers to the occurrence of an individual panel which can be applied to a surface such as a wall or be aggregated within a Signal Assembly which can include multiple sign occurrences and the associated supporting structural elements (see Signal Assembly for examples).\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSign.htm", "predefined_types": {"MARKER": "A Sign type formed of a vertical post (possibly with some lettering or symbols) usually used to delimitate distance or the location of some equipment.", "MIRROR": "A sign type that provides information via a reflective mirror surface.", "NOTDEFINED": "Undefined type.", "PICTORAL": "A sign type formed of a flat plate with some written or symbolic images on it.", "USERDEFINED": "User-defined type"}}, "IfcSignalType / IfcSignal": {"description": "A signal is an active device that conveys information or instructions to users, by means of an audio, visual signal or a combination of both.\nThe primary distinction from an IfcSign is that a signal is active and therefore a subtype of IfcFlowTerminal usually requiring power and data connections for its operation.\nAn instance of IfcSignal represents a singular signalling device in a larger assembled unit or connected system, such as an individual frame within a railway signal, a single light unit in a traffic light system or an audio signal or light mounted on a navigational buoy.\nSignals can be physically aggregated together into an assembly which can include multiple signal instances (and also sign instances) and the associated supporting structural elements such as a simple pole or a rigid frame gantry (see Signal Assembly for examples).\nSignals can be logically (functionally) grouped together into a signalling system (a type of distribution system) to represent a connected  group o ...", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSignal.htm", "predefined_types": {"AUDIO": "A signal type formed of an active device conveying information by emitting an audio signal such as a  beep, ring, horn or explosive sound.", "MIXED": "A signal type formed of an active device conveying information in both a visual and audio manner.", "NOTDEFINED": "Undefined type.", "USERDEFINED": "User-defined type", "VISUAL": "A signal type formed of an active device conveying information in a visual manner such as a light, cluster of lights, or mechanical moving shapes."}}, "IfcSlabType / IfcSlab": {"description": "A slab is a component of the construction that may enclose a space vertically. The slab may provide the lower support (floor) or upper construction (roof slab) in any space in a building.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSlab.htm", "predefined_types": {"APPROACH_SLAB": "Iis part of bridge abutment providing transition from embankment to the bridge", "BASESLAB": "The slab is used to represent a floor slab against the ground (and thereby being a part of the foundation). Another name is mat foundation.", "FLOOR": "The slab is used to represent a floor slab or a bridge deck.", "LANDING": "The slab is used to represent a landing within a stair or ramp.", "NOTDEFINED": "", "PAVING": "Rigid pavement course of a road or other paved area, usually concrete.", "ROOF": "The slab is used to represent a roof slab (either flat or sloped).", "SIDEWALK": "The slab is used to represent a sidewalk.", "TRACKSLAB": "A track slab is a reinforced concrete slab or prestressed reinforced concrete slab, which is a main element of slab track. It can be prefabricated or cast on site and may have sleepers embedded.", "USERDEFINED": "", "WEARING": "The slab is used to represent a wearing surface."}}, "IfcSolarDeviceType / IfcSolarDevice": {"description": "A solar device converts solar radiation into other energy such as electric current or thermal energy.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSolarDevice.htm", "predefined_types": {"NOTDEFINED": "Undefined type.", "SOLARCOLLECTOR": "A device that converts solar radiation into thermal energy (heating water, etc.).", "SOLARPANEL": "A device that converts solar radiation into electric current.", "USERDEFINED": "User-defined type."}}, "IfcSpaceHeaterType / IfcSpaceHeater": {"description": "Space heaters utilize a combination of radiation and/or natural convection using a heating source such as electricity, steam or hot water to heat a limited space or area. Examples of space heaters include radiators, convectors, baseboard and finned-tube heaters.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSpaceHeater.htm", "predefined_types": {"CONVECTOR": "A heat-distributing unit that operates with gravity-circulated air.", "NOTDEFINED": "Undefined space heater type.", "RADIATOR": "A heat-distributing unit that operates with thermal radiation.", "USERDEFINED": "User-defined space heater type."}}, "IfcStackTerminalType / IfcStackTerminal": {"description": "A stack terminal is placed at the top of a ventilating stack (such as to prevent ingress by birds or rainwater) or rainwater pipe (to act as a collector or hopper for discharge from guttering).", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcStackTerminal.htm", "predefined_types": {"BIRDCAGE": "Guard cage, typically wire mesh, at the top of the stack preventing access by birds.", "COWL": "A cowling placed at the top of a stack to eliminate downdraft.", "NOTDEFINED": "Undefined type.", "RAINWATERHOPPER": "A box placed at the top of a rainwater downpipe to catch rainwater from guttering.", "USERDEFINED": "User-defined type."}}, "IfcStairFlightType / IfcStairFlight": {"description": "A stair flight is an assembly of building components in a single \"run\" of stair steps (not interrupted by a landing). The stair steps and any stringers are included in the stair flight. A winder is also regarded a part of a stair flight.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcStairFlight.htm", "predefined_types": {"CURVED": "A stair flight with a curved walking line.", "FREEFORM": "A stair flight with a free form walking line (and outer boundaries).", "NOTDEFINED": "Undefined stair flight.", "SPIRAL": "A stair flight with a circular or elliptic walking line.", "STRAIGHT": "A stair flight with a straight walking line.", "USERDEFINED": "User-defined stair flight.", "WINDER": "A stair flight with a walking line including straight and curved sections."}}, "IfcStairType / IfcStair": {"description": "A stair is a vertical passageway allowing occupants to walk (step) from one floor level to another floor level at a different elevation. It may include a landing as an intermediate floor slab.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcStair.htm", "predefined_types": {"CURVED_RUN_STAIR": "A stair extending from one level to another without turns or winders. The stair is consisting of one curved flight.", "DOUBLE_RETURN_STAIR": "A stair having one straight flight to a wide quarterspace landing, and two side flights from that landing into opposite directions. The stair is making a 90° turn. The direction of traffic is determined by the walking line.", "HALF_TURN_STAIR": "A stair making a 180° turn, consisting of two straight flights connected", "HALF_WINDING_STAIR": "A stair consisting of one flight with one half winder, which makes a 180° turn. The orientation of the turn is determined by the walking line.", "LADDER": "a piece of equipment consisting of a series of bars or steps between two upright elements used for climbing up or down something", "NOTDEFINED": "", "QUARTER_TURN_STAIR": "A stair making a 90° turn, consisting of two straight flights connected by a quarterspace landing. The direction of the turn is determined by the walking line.", "QUARTER_WINDING_STAIR": "A stair consisting of one flight with a quarter winder, which is making a 90° turn. The direction of the turn is determined by the walking line.", "SPIRAL_STAIR": "A stair constructed with winders around a circular newel often without landings. Depending on outer boundary it can be either a circular, elliptical or rectangular spiral stair. The orientation of the winding stairs is determined by the walking line.", "STRAIGHT_RUN_STAIR": "A stair extending from one level to another without turns or winders. The stair consists of one straight flight.", "THREE_QUARTER_TURN_STAIR": "A stair making a 270° turn, consisting of four straight flights connected by three quarterspace landings. The direction of the turns is determined by the walking line.", "THREE_QUARTER_WINDING_STAIR": "A stair consisting of one flight with three quarter winders, which make a 90° turn. The stair makes a 270° turn. The direction of the turns is determined by the walking line.", "TWO_CURVED_RUN_STAIR": "A curved stair consisting of two curved flights without turns but with one landing.", "TWO_QUARTER_TURN_STAIR": "A stair making a 180° turn, consisting of three straight flights connected by two quarterspace landings. The direction of the turns is determined by the walking line.", "TWO_QUARTER_WINDING_STAIR": "A stair consisting of one flight with two quarter winders, which make a 90° turn. The stair makes a 180° turn. The direction of the turns is determined by the walking line.", "TWO_STRAIGHT_RUN_STAIR": "A straight stair consisting of two straight flights without turns but with one landing.", "USERDEFINED": "Free form stair (user defined operation type)."}}, "IfcSurfaceFeature": {"description": "A surface feature is a modification at (onto, or into) of the surface of an element. Parts of the surface of the entire surface may be affected. The volume and mass of the element may be increased, remain unchanged, or be decreased by the surface feature, depending on manufacturing technology. However, any increase or decrease of volume is small compared to the total volume of the element.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSurfaceFeature.htm", "predefined_types": {"DEFECT": "Detected defect on the surface of an element, such as corroded or eroded area.", "HATCHMARKING": "surface markings defined by enclosed 2d shape with defined hatch fillings.", "LINEMARKING": "2D lines painted on pavement surfaces to form boundaries, centrelines and edge markings.", "MARK": "A point, line, cross, or other mark, applied for example for easier adjustment of elements during assembly.", "NONSKIDSURFACING": "Paint or surfacing to prevent sliding or skidding.", "NOTDEFINED": "An undefined type of surface feature.", "PAVEMENTSURFACEMARKING": "Painted or chemical lines or symbols on the surface of pavements (a road or paved area)", "RUMBLESTRIP": "Raised and often textured strips on road center line or on shoulder, or across lanes to alert drivers by vibration and noise. Also Jiggle bars.", "SYMBOLMARKING": "Surface markings that convey information in the form of symbols and shapes such as arrows, text or pictorial symbols.", "TAG": "A name tag, which allows to identify an element during production, delivery and assembly.  May be manufactured in different ways, e.g. by printing or punching the tracking code onto the element or by attaching an actual tag.", "TRANSVERSERUMBLESTRIP": "Type of rumble strip running across lane(s).", "TREATMENT": "A subtractive surface feature, e.g. grinding, or an additive surface feature, e.g. coating, or an impregnating treatment, or a series of any of these kinds of treatments.", "USERDEFINED": "A user-defined type of surface feature."}}, "IfcSwitchingDeviceType / IfcSwitchingDevice": {"description": "A switch is used in a cable distribution system (electrical circuit) to control or modulate the flow of electricity.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSwitchingDevice.htm", "predefined_types": {"CONTACTOR": "An electrical device used to control the flow of power in a circuit on or off.", "DIMMERSWITCH": "A dimmer switch has variable positions, and may adjust electrical power or other setting (according to the switched port type).", "EMERGENCYSTOP": "An emergency stop device acts to remove as quickly as possible any danger that may have arisen unexpectedly.", "KEYPAD": "A set of buttons or switches, each potentially applicable to a different device.", "MOMENTARYSWITCH": "A momentary switch has no position, and may trigger some action to occur.", "NOTDEFINED": "Undefined type.", "RELAY": "A device designed to produce sudden predetermined changes in one or more electric output circuits, when certain conditions are fulfilled in the electric input circuits controlling the device. Note: definition from IEC 60050 151-13-31.", "SELECTORSWITCH": "A selector switch has multiple positions, and may change the source or level of power or other setting (according to the switched port type).", "STARTER": "A starter is a switch which in the closed position controls the application of power to an electrical device.", "START_AND_STOP_EQUIPMENT": "A switch for alternatively closing and opening one or more electric circuits.", "SWITCHDISCONNECTOR": "A switch disconnector is a switch which in the open position satisfies the isolating requirements specified for a disconnector.", "TOGGLESWITCH": "A toggle switch has two positions, and may enable or isolate electrical power or other setting (according to the switched port type).", "USERDEFINED": "User-defined type."}}, "IfcSystemFurnitureElementType / IfcSystemFurnitureElement": {"description": "A system furniture element defines components of modular furniture which are not directly placed in a building structure but aggregated inside furniture.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcSystemFurnitureElement.htm", "predefined_types": {"NOTDEFINED": "Undefined type.", "PANEL": "Vertical panel used to divide work spaces.", "SUBRACK": "A subrack is a part of technical cabinet which is used to store and mount pluggable electric subunits.", "USERDEFINED": "User-defined type.", "WORKSURFACE": "Workstation countertop."}}, "IfcTankType / IfcTank": {"description": "A tank is a vessel or container in which a fluid or gas is stored for later use.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTank.htm", "predefined_types": {"BASIN": "An arbitrary open tank type.", "BREAKPRESSURE": "An open container that breaks the hydraulic pressure in a distribution system, typically located between the fluid reservoir and the fluid supply points. A typical break pressure tank allows the flow to discharge into the atmosphere, thereby reducing its hydrostatic pressure to zero.", "EXPANSION": "A closed container used in a closed fluid distribution system to mitigate the effects of thermal expansion or water hammer. The tank is typically constructed with a diaphragm dividing the tank into two sections, with fluid on one side of the diaphragm and air on the other. One example application is when connected to the primary circuit of a hot water system to accommodate the increase in volume of the water when it is heated.", "FEEDANDEXPANSION": "An open tank that is used for both storage and thermal expansion. A typical example is a tank used to store make-up water at ambient pressure for supply to a hot water system, simultaneously accommodating increases in volume of the water when heated.", "NOTDEFINED": "Undefined tank type.", "OILRETENTIONTRAY": "An open container for environmental protection and storage of chemical products.", "PRESSUREVESSEL": "A closed container used for storing fluids or gases at a pressure different from the ambient pressure. A pressure vessel is typically rated by an authority having jurisdiction for the operational pressure.", "STORAGE": "An open or closed container used for storing a fluid at ambient pressure and from which it can be supplied to the fluid distribution system. There are many examples of storage tanks, such as potable water storage tanks, fuel storage tanks, etc.", "USERDEFINED": "User-defined tank type.", "VESSEL": "An arbitrary closed tank type."}}, "IfcTendonAnchorType / IfcTendonAnchor": {"description": "A tendon anchor is the end connection for tendons in prestressed or posttensioned concrete.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTendonAnchor.htm", "predefined_types": {"COUPLER": "The anchor is an intermediate device which connects two tendons.", "FIXED_END": "The anchor fixes the end of a tendon.", "NOTDEFINED": "The type of tendon anchor is not defined.", "TENSIONING_END": "The anchor is used or can be used to prestress the tendon.", "USERDEFINED": "The type of tendon anchor is user defined."}}, "IfcTendonConduitType / IfcTendonConduit": {"description": "A TendonConduit represents the components of the conduit system for tendons embedded in concrete structure.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTendonConduit.htm", "predefined_types": {"COUPLER": "A part to connect the conduits located in two different deck segments and related to the same tendon.", "DIABOLO": "A part of tendon conduit associated to deviator.", "DUCT": "A Sleeve or duct is related to the thickness of the conduit depending on the conduit, either cast into the concrete structure or placed adjacent to it.", "GROUTING_DUCT": "An additional small conduit connected to the main conduit to allow grouting in case of bonded post-tensioning, such as  Grout inlet, Grout outlet and Grout vent.", "NOTDEFINED": "The type of tendon conduit is not defined.", "TRUMPET": "A specific part of conduit which has to be widened when reaching the tendon anchor because the strands are connected individually on the anchor.", "USERDEFINED": "The type of tendon conduit is user defined."}}, "IfcTendonType / IfcTendon": {"description": "A tendon is a steel element such as a wire, cable, bar, rod, or strand used to impart prestress to concrete when the element is tensioned.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTendon.htm", "predefined_types": {"BAR": "The tendon is configured as a bar.", "COATED": "The tendon is coated.", "NOTDEFINED": "The type of tendon is not defined.", "STRAND": "The tendon is a strand.", "USERDEFINED": "The type of tendon is user defined.", "WIRE": "The tendon is a wire."}}, "IfcTrackElementType / IfcTrackElement": {"description": "A track element is a built element used specifically in the track domain in railway.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTrackElement.htm", "predefined_types": {"BLOCKINGDEVICE": "A device composed of pneumatic, mechanic or electric components causing the braking of a train in case of emergency.", "DERAILER": "A fixed device which, when placed on the rail, derails the wheels of a vehicle, and serves to protect a converging line. Note: definition from IEC 60050-821.", "FROG": "A frog is an arrangement ensuring the intersection of two opposite running edges of turnouts or diamond crossings and having one crossing vee and two wing rails. Note: definition from EN 13232-1-2004.", "HALF_SET_OF_BLADES": "A half set of blades consists of one stock rail and its switch rail complete with small fittings. It is right or left hand as seen by an observer in the centre of the track facing the switch heel from the switch toe. Note: definition from EN 13232-1-2004.", "NOTDEFINED": "Undefined type.", "SLEEPER": "A sleeper is a track element that supports running rails, guard rails and check rails usually at right angles to its axis.", "SPEEDREGULATOR": "A device composed of pneumatic, mechanic or electric components causing the breaking of a train in case of emergency.", "TRACKENDOFALIGNMENT": "A track end of alignment is a special functional installation such as axle-gauge changeover point or transporter wagon loading point.", "USERDEFINED": "User-defined type", "VEHICLESTOP": "A fixed installation at the end of the track which stops any vehicle movement (e.g., buffer stop, sand hump, etc.)."}}, "IfcTransformerType / IfcTransformer": {"description": "A transformer is an inductive stationary device that transfers electrical energy from one circuit to another.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTransformer.htm", "predefined_types": {"CHOPPER": "A chopper is an electronic power DC convertor without an intermediate AC link giving a variable output voltage by varying the periods of conduction and non-conduction in an adjustable ratio.", "COMBINED": "A transformer that changes different quantities between circuits.", "CURRENT": "A transformer that changes the current between circuits.", "FREQUENCY": "A transformer that changes the frequency between circuits.", "INVERTER": "A transformer that converts from direct current (DC) to alternating current (AC).", "NOTDEFINED": "Undefined type.", "RECTIFIER": "A transformer that converts from alternating current (AC) to direct current (DC).", "USERDEFINED": "User-defined type.", "VOLTAGE": "A transformer that changes the voltage between circuits."}}, "IfcTransportElementType / IfcTransportElement": {"description": "A transport element is a generalization of all transport related objects that move people, animals or goods within a Facility. The IfcTransportElement defines the occurrence of a transport element, that (if given), is expressed by the IfcTransportElementType.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTransportElement.htm", "predefined_types": {"CRANEWAY": "A crane way system, normally including the crane rails, fasteners and the crane. It is primarily used to move heavy goods in a factory or other industry buildings.", "ELEVATOR": "Elevator or lift being a transport device to move people of good vertically.", "ESCALATOR": "Escalator being a transport device to move people. It consists of individual linked steps that move up and down on tracks while keeping the threads horizontal.", "HAULINGGEAR": "A device used for hauling goods.", "LIFTINGGEAR": "A device used for lifting or lowering heavy goods. It may be manually operated or electrically or pneumatically driven.", "MOVINGWALKWAY": "Moving walkway being a transport device to move people horizontally or on an incline. It is a slow conveyor belt that transports people.", "NOTDEFINED": "", "USERDEFINED": ""}}, "IfcTubeBundleType / IfcTubeBundle": {"description": "A tube bundle is a device consisting of tubes and bundles of tubes used for heat transfer and contained typically within other energy conversion devices, such as a chiller or coil.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcTubeBundle.htm", "predefined_types": {"FINNED": "Finned tube bundle type.", "NOTDEFINED": "Undefined tube bundle type.", "USERDEFINED": "User-defined tube bundle type."}}, "IfcUnitaryControlElementType / IfcUnitaryControlElement": {"description": "A unitary control element combines a number of control components into a single product, such as a thermostat or humidistat.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcUnitaryControlElement.htm", "predefined_types": {"ALARMPANEL": "A control element at which alarms are annunciated.", "BASESTATIONCONTROLLER": "A base station controller (BSC) is a network component with the functions for controlling one or more base transceiver stations. BSC is responsible for the management of various interfaces, wireless resources and parameters, the signalling processing of call establishment and the channel allocation in the cell.", "COMBINED": "Combination of at least two predefined types of unitary control element.", "CONTROLPANEL": "A control element at which devices that control or monitor the operation of a site, building or part of a building are located", "GASDETECTIONPANEL": "A control element at which the detection of gas is annunciated.", "HUMIDISTAT": "A control element that senses and regulates the humidity of a system or space so that the humidity is maintained near a desired setpoint.", "INDICATORPANEL": "A control element at which equipment operational status, condition, safety state or other required parameters are indicated.", "MIMICPANEL": "A control element at which information that is available elsewhere is repeated or 'mimicked'.", "NOTDEFINED": "Undefined type.", "THERMOSTAT": "A control element that senses and regulates the temperature of an element, system or space so that the temperature is maintained near a desired setpoint.", "USERDEFINED": "User-defined type.", "WEATHERSTATION": "A control element that senses multiple climate properties such as temperature, humidity, pressure, wind, and rain."}}, "IfcUnitaryEquipmentType / IfcUnitaryEquipment": {"description": "Unitary equipment typically combine a number of components into a single product, such as air handlers, pre-packaged rooftop air-conditioning units, heat pumps, and split systems.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcUnitaryEquipment.htm", "predefined_types": {"AIRCONDITIONINGUNIT": "A unitary packaged air-conditioning unit typically used in residential or light commercial applications.", "AIRHANDLER": "A unitary air handling unit typically containing a fan, economizer, and coils.", "DEHUMIDIFIER": "A unitary packaged dehumidification unit.  Note: units supporting multiple modes (dehumidification, cooling, and/or heating) should use AIRCONDITIONINGUNIT.", "NOTDEFINED": "Undefined unitary equipment type.", "ROOFTOPUNIT": "A packaged assembly that is either field-erected or manufactured atop the roof of a large residential or commercial building and acts as a unitary component.", "SPLITSYSTEM": "A system which separates the compressor from the evaporator, but acts as a unitary component typically within residential or light commercial applications.", "USERDEFINED": "User-defined unitary equipment type."}}, "IfcValveType / IfcValve": {"description": "A valve is used in a building services piping distribution system to control or modulate the flow of the fluid.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcValve.htm", "predefined_types": {"AIRRELEASE": "Valve used to release air from a pipe or fitting.", "ANTIVACUUM": "Valve that opens to admit air if the pressure falls below atmospheric pressure.", "CHANGEOVER": "Valve that enables flow to be switched between pipelines (3 or 4 port).", "CHECK": "Valve that permits water to flow in one direction only and is enclosed when there is no flow (2 port).", "COMMISSIONING": "Valve used to facilitate commissioning of a system (2 port).", "DIVERTING": "Valve that enables flow to be diverted from one branch of a pipeline to another (3 port).", "DOUBLECHECK": "An assembly that incorporates two valves used to prevent backflow.", "DOUBLEREGULATING": "Valve used to facilitate regulation of fluid flow in a system.", "DRAWOFFCOCK": "A valve used to remove fluid from a piping system.", "FAUCET": "Faucet valve typically used as a flow discharge.", "FLUSHING": "Valve that flushes a predetermined quantity of water to cleanse a toilet, urinal, etc.", "GASCOCK": "Valve that is used for controlling the flow of gas.", "GASTAP": "Gas tap typically used for venting or discharging gas from a system.", "ISOLATING": "Valve that closes off flow in a pipeline.", "MIXING": "Valve that enables flow from two branches of a pipeline to be mixed together (3 port).", "NOTDEFINED": "Undefined valve type.", "PRESSUREREDUCING": "Valve that reduces the pressure of a fluid immediately downstream of its position in a pipeline to a preselected value or by a predetermined ratio.", "PRESSURERELIEF": "Spring or weight loaded valve that automatically discharges to a safe place fluid that has built up to excessive pressure in pipes or fittings.", "REGULATING": "Valve used to facilitate regulation of fluid flow in a system.", "SAFETYCUTOFF": "Valve that closes under the action of a safety mechanism such as a drop weight, solenoid etc.", "STEAMTRAP": "Valve that restricts flow of steam while allowing condensate to pass through.", "STOPCOCK": "An isolating valve used on a domestic water service.", "USERDEFINED": "User-defined valve type."}}, "IfcVehicleType / IfcVehicle": {"description": "A Vehicle.\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcVehicle.htm", "predefined_types": {"CARGO": "A mobile transport element that represents a discrete unit of cargo managed by a facility.", "NOTDEFINED": "Undefined type.", "ROLLINGSTOCK": "Refers to railway vehicles, including both powered and unpowered vehicles, for example locomotives, railroad cars, coaches, private railroad cars and wagons.", "USERDEFINED": "User-defined type", "VEHICLE": "a generalisation of a vehicle that interacts with a facility (e.g. as a user/customer) or as a specified operational asset within the facility.", "VEHICLEAIR": "A specialisation of a vehicle that represents powered and unpowered flying vehicles, such as airplanes, helicopters, gliders etc.", "VEHICLEMARINE": "A specialisation of a vehicle that operates on water as a marine vessel.", "VEHICLETRACKED": "A specialisation of a vehicle that operates on land tracked (Caterpillar) vehicle.", "VEHICLEWHEELED": "A specialisation of a vehicle that operates on land as a multi wheeled vehicle such as a car, lorry, forklift etc."}}, "IfcVibrationDamperType / IfcVibrationDamper": {"description": "A vibration damper is a device used to minimize the effects of vibration in a structure by dissipating kinetic energy. The damper may be passive (elastic, frictional, inertia) or active (in a system using sensors and actuators).\n", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcVibrationDamper.htm", "predefined_types": {"AXIAL_YIELD": "A displacement dependent type damper in which the resistance force generated is determined by the plastic strain amount utilizing the plastic deformation of the steel material. The axial yield type is a damper that yields energy by absorbing the steel material against deformation in the axial direction, that is, in the direction of expansion and contraction.", "BENDING_YIELD": "A displacement dependent type damper in which the resistance force generated is determined by the plastic strain amount utilizing the plastic deformation of the steel material. The bending yield type is a damper, which yields steel material by bending.", "FRICTION": "The friction type is a damper utilizing friction acting on the contact surface of a material.", "NOTDEFINED": "Undefined vibration damper type.", "RUBBER": "The rubber mold is a damper that absorbs energy by utilizing deformation of laminated rubber. The difference between the seismic isolation bearing and the rubber type damper is whether or not to support the weight of the upper structures. The rubber damper does not transmit the weight of the upper structures to the sub structure.", "SHEAR_YIELD": "A displacement dependent type damper in which the resistance force generated is determined by the plastic strain amount utilizing the plastic deformation of the steel material. The shear yield type is a damper, which causes the steel material to yield for deformation in the direction perpendicular to the member.", "USERDEFINED": "User-defined vibration damper type.", "VISCOUS": "The viscous type is a damper that absorbs energy by utilizing the resistance of a viscous body."}}, "IfcVibrationIsolatorType / IfcVibrationIsolator": {"description": "A vibration isolator is a device used to minimize the effects of vibration transmissibility in a structure.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcVibrationIsolator.htm", "predefined_types": {"BASE": "Base isolator preventing transfer of energy from the ground to the structure.", "COMPRESSION": "Compression type vibration isolator.", "NOTDEFINED": "Undefined vibration isolator type.", "SPRING": "Spring type vibration isolator.", "USERDEFINED": "User-defined vibration isolator type."}}, "IfcVirtualElement": {"description": "A virtual element is a special element used to provide imaginary, placeholder, or provisional areas, volumes, and boundaries. Virtual elements are usually not displayed and do not have quantities, associated materials, and other measures.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcVirtualElement.htm", "predefined_types": {"BOUNDARY": "An imaginary boundary, such as between two adjacent spaces that are not separated by a physcial boundary.", "CLEARANCE": "The virtual element denotes a clearance area or volume", "NOTDEFINED": "", "PROVISIONFORVOID": "The virtual element denotes a proposed provision for voids (an proposed opening not applied as void yet).", "USERDEFINED": ""}}, "IfcVoidingFeature": {"description": "A voiding feature is a modification of an element which reduces its volume. Such a feature may be manufactured in different ways, for example by cutting, drilling, or milling of members made of various materials, or by inlays into the formwork of cast members made of materials such as concrete.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcVoidingFeature.htm", "predefined_types": {"CHAMFER": "A skewed plane end cut, removing material only across a part of the profile of the voided element.", "CUTOUT": "An internal cutout (creating an opening) or external cutout (creating a recess) of arbitrary shape.  The edges between cutting planes may be overcut or undercut, i.e. rounded.", "EDGE": "A shape modification along an edge of the element with the edge length as the predominant dimension of the feature, and feature profile dimensions which are typically much smaller than the edge length.  Can for example be a chamfer edge (differentiated from a chamfer by its ratio of dimensions and thus usually manufactured differently), rounded edge (a convex edge feature), or fillet edge (a concave edge feature).", "HOLE": "A circular or slotted or threaded hole, typically but not necessarily of smaller dimension than what would be considered a cutout.", "MITER": "A skewed plane end cut, removing material across the entire profile of the voided element.", "NOTCH": "An external cutout of with a mostly rectangular cutting profile.  The edges between cutting planes may be overcut or undercut, i.e. rounded.", "NOTDEFINED": "An undefined type of voiding feature.", "USERDEFINED": "A user-defined type of voiding feature."}}, "IfcWallType / IfcWall / IfcWallStandardCase": {"description": "The wall represents a vertical construction that may bound or subdivide spaces. Wall are usually vertical, or nearly vertical, planar elements, often designed to bear structural loads. A wall is however not required to be load bearing.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcWall.htm", "predefined_types": {"ELEMENTEDWALL": "A stud wall framed with studs and faced with sheetings, sidings, wallboard, or plasterwork. { .deprecated}", "MOVABLE": "A movable wall that is either movable, such as folding wall or a sliding wall, or can be easily removed as a removable partitioning or mounting wall. Movable walls do normally not define space boundaries and often belong to the furnishing system.", "NOTDEFINED": "Undefined wall element.", "PARAPET": "A wall-like barrier to protect human or vehicle from falling, or to prevent the spread of fires. Often designed at the edge of balconies, terraces or roofs, or along edges of bridges.", "PARTITIONING": "A wall designed to partition spaces that often has a light-weight, sandwich-like construction (e.g. using gypsum board). Partitioning walls are normally non load bearing.", "PLUMBINGWALL": "A pier, or enclosure, or encasement, normally used to enclose plumbing in sanitary rooms. Such walls often do not extent to the ceiling.", "POLYGONAL": "A polygonal wall, extruded vertically, where the wall thickness varies along the wall path.", "RETAININGWALL": "A supporting wall used to protect against soil layers behind. Special types of a retaining wall may be e.g. Gabion wall and Grib wall. Examples of retaining walls are wing wall, headwall, stem wall, pierwall and protecting wall.", "SHEAR": "A wall designed to withstand shear loads. Examples of shear wall are diaphragms inside a box girder, typically on a pier, to resist lateral forces and transfer them to the support.", "SOLIDWALL": "A massive wall construction for the wall core being the single layer or having multiple layers attached. Such walls are often masonry or concrete walls (both cast in-situ or precast) that are load bearing and fire protecting.", "STANDARD": "A standard wall, extruded vertically with a constant thickness along the wall path. { .deprecated}", "USERDEFINED": "User-defined wall element.", "WAVEWALL": "Protective wall or screen to block overtopping and impact of waves across a breakwater"}}, "IfcWasteTerminalType / IfcWasteTerminal": {"description": "A waste terminal has the purpose of collecting or intercepting waste from one or more sanitary terminals or other fluid waste generating equipment and discharging it into a single waste/drainage system.", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcWasteTerminal.htm", "predefined_types": {"FLOORTRAP": "Pipe fitting, set into the floor, that retains liquid to prevent the passage of foul air", "FLOORWASTE": "Pipe fitting, set into the floor, that collects waste water and discharges it to a separate trap.", "GULLYSUMP": "Pipe fitting or assembly of fittings to receive surface water or waste water, fitted with a grating or sealed cover.", "GULLYTRAP": "Pipe fitting or assembly of fittings that receives surface water or waste water; fitted with a grating or sealed cover that discharges water through a trap.", "NOTDEFINED": "Undefined type.", "ROOFDRAIN": "Pipe fitting, set into the roof, that collects rainwater for discharge into the rainwater system.", "USERDEFINED": "User-defined type.", "WASTEDISPOSALUNIT": "Electrically operated device that reduces kitchen or other waste into fragments small enough to be flushed into a drainage system.", "WASTETRAP": "Pipe fitting, set adjacent to a sanitary terminal, that retains liquid to prevent the passage of foul air."}}, "IfcWindowType / IfcWindow": {"description": "The window is a building element that is predominately used to provide natural light and fresh air. It includes vertical opening but also horizontal opening such as skylights or light domes. It includes constructions with swinging, pivoting, sliding, or revolving panels and fixed panels. A window consists of a lining and one or several panels. A window can:", "spec_url": "https://ifc43-docs.standards.buildingsmart.org/IFC/RELEASE/IFC4x3/HTML/lexical/IfcWindow.htm", "predefined_types": {"LIGHTDOME": "A special window that lies horizonally in a roof slab opening.", "NOTDEFINED": "Undefined window element.", "SKYLIGHT": "A window within a sloped building element, usually a roof slab.", "USERDEFINED": "User-defined window element.", "WINDOW": "A standard window usually within a wall opening, as a window panel in a curtain wall, or as a \"free standing\" window."}}}